{"review_id": "gginIHkTUyEC5TJcWsW0sQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "Vjb8dsOwTXQU-4bdmNzfbw", "rating": 5.0, "timestamp": "2017-10-09 04:08:23", "review_text": "Still delicious!!  I love the apps, especially the cauliflower!  We also had a samosa chat and some garlic naan. A chai to wash it all down made for a perfect after-theater nosh!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes that are commonly associated with Indian cuisine.", "specific_dishes_or_attributes": "The cauliflower appetizer was delicious, and the garlic naan was also enjoyed.", "visit_purpose": "Post-theater dining", "visit_purpose_reason": "The review indicates that the meal was enjoyed after attending a theater performance.", "quality_criteria": "The appetizers, particularly the cauliflower, were delicious, while the garlic naan was also positively noted.", "visit_context": "After attending a theater performance", "visit_context_reason": "The review mentions enjoying the meal after a theater performance, indicating the timing and context."}}
{"review_id": "YeZ04_NO24lvKsAUs8UnTQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "_BiFDHusWmQ5AnYq0qHCPw", "rating": 4.0, "timestamp": "2017-10-14 12:18:36", "review_text": "I needed to make a last minute reservation last night and was able to get one at IndeBlue. \n\nWow - I'm not sure how I missed this place, but I need to come back to happy hour. Prices for entrees were a little steep but everything was perfect, the food, the service, and the vibe.", "extracted_aspects": {"cuisine_category": null, "cuisine_category_reason": null, "specific_dishes_or_attributes": "The prices for entrees were a little steep, but everything was perfect, including the food, the service, and the vibe.", "visit_purpose": "The primary motivation for the visit was to dine at IndeBlue.", "visit_purpose_reason": "The diner made a last minute reservation, indicating a spontaneous decision to dine out.", "quality_criteria": "The food, the service, and the vibe were all perfect, but the prices for entrees were a little steep.", "visit_context": "The visit occurred last night.", "visit_context_reason": "The diner mentioned making a last minute reservation last night."}}
{"review_id": "aaWUOTJuo7pCtpvT9xjQJQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "ex0hjYWW_kHJHhzN0LQmVA", "rating": 5.0, "timestamp": "2017-11-07 16:00:38", "review_text": "It's hard to get a good meal on a Saturday night in Center City without a reservation, or so I thought... until IndieBlue rocked my world.  \n\nI've been to IndieBlue in Collingswood so I thought that I knew what I was getting myself into, but boy was I wrong. Our party of four decided to split a few small plates and one larger entrée and every single thing that we ordered was off the charts! The crispy spinach chaat was crispy, yet juicy, in a way that I find hard to explain. The shrimp roti tacos were an awesome and unexpected standout and the tandoori mixed grill and bread basket were a great way to sample a little bit of a lot of different flavors. \n\nPrices were reasonable for an upscale, center city restaurant and the servers were all friendly and attentive. I'll definitely be back for happy hour at the very least!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like 'crispy spinach chaat', 'shrimp roti tacos', and 'tandoori mixed grill', indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The crispy spinach chaat was crispy, yet juicy, and the shrimp roti tacos were an awesome and unexpected standout.", "visit_purpose": "To enjoy a good meal on a Saturday night.", "visit_purpose_reason": "The diner expresses a desire to enjoy a good meal on a Saturday night, which indicates the primary motivation for the visit.", "quality_criteria": "The prices were reasonable for an upscale restaurant, and the servers were friendly and attentive.", "visit_context": "A party of four visited on a Saturday night.", "visit_context_reason": "The review mentions a party of four dining together on a Saturday night."}}
{"review_id": "9GQFme8pPVg1iEa860L4vQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "OVoM0VzWh_Mneq-69_GzeQ", "rating": 5.0, "timestamp": "2017-11-14 14:45:59", "review_text": "I have come here a few times for dinner and twice for brunch. I clearly love the brunch menu - it is such a great fusion of Indian and few other cuisines with the Indian element dominating. Their rose mimosas are amazing - I am pretty sure it is not rosè but rose (or both) because it smells like roses. I love their drums of heaven (literally) and paneer bhurji that comes with a chilli naan, the spicy chicken and waffle is quite different but not my favorite and pav bhaji is pretty good as well. However my favorite thing, other than the mimosas, is their Fig Kulfi. I think they really hit it out of the park with it - please give it a try!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions a fusion of Indian and other cuisines, with the Indian element dominating.", "specific_dishes_or_attributes": "The reviewer loves the drums of heaven and paneer bhurji, but finds the spicy chicken and waffle quite different and not their favorite.", "visit_purpose": "To enjoy the brunch menu and dinner offerings.", "visit_purpose_reason": "The reviewer has visited multiple times for dinner and brunch, indicating a desire to enjoy the food.", "quality_criteria": "The rose mimosas and Fig Kulfi are praised as amazing, while the spicy chicken and waffle is noted as not a favorite.", "visit_context": "The reviewer visited the restaurant multiple times for dinner and brunch.", "visit_context_reason": "The reviewer states they have come a few times for dinner and twice for brunch."}}
{"review_id": "q4o_n37tWg3TyTnI9kanGA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "5GLB61xLOP6T-pNsr7rslg", "rating": 5.0, "timestamp": "2017-11-18 18:47:39", "review_text": "This review is for the happy hour experience:\n\nSolid HH options with yummy food and delicious drinks. The bartender here is very friendly and chill so it was easy to get our orders in. My friend got their monsoon which has a hint of chai flavor. I loved my ginger jadoo since I'm a huge fan of ginger. I recommend their cauliflower and their chicken masala pizza...def coming again!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like chicken masala pizza and cauliflower, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The reviewer loved the ginger jadoo for its ginger flavor and recommended the cauliflower and chicken masala pizza.", "visit_purpose": "Enjoying happy hour food and drinks", "visit_purpose_reason": "The review describes a happy hour experience, indicating the purpose was likely to enjoy food and drinks during that time.", "quality_criteria": "The food options were described as yummy, and the drinks were delicious, while the bartender was friendly and chill.", "visit_context": "Visited during happy hour with a friend", "visit_context_reason": "The review mentions that the visit was during happy hour with a friend, providing context about who was present and when."}}
{"review_id": "m83r0FgufssepOV83g2a0Q", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "g3uCwZtwi5CFrjkccBDEjw", "rating": 3.0, "timestamp": "2017-11-21 11:21:55", "review_text": "IndeBlue is a trendy Indian fusion spot located on 13th street, between Walnut and Locust. We walked in, my two dining companions and me, and asked for a table. The hostess was incredibly rude; she cut me off when I was asking her a question, and was very unfriendly. It was 5 pm on a weekend, and the place was only 1/3 full, so there was no need for that kind of attitude. Fortunately, our server was wonderful! We ordered cocktails, three small plates, one medium plate, two entrees, and a side of naan. The standout was the cocktails, for sure. I ordered the chai sangria, which was spicy and not too sweet. While the food was decent, it did not impress my native Indian companion, who noted that, while it was quality, it's not necessarily a place worth spending a significant amount of money on Indian food.\n\nOverall, I would return for happy hour or for drinks, but I think I'll skip the actual meal next time.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions Indian food specifically, indicating a preference for this cuisine.", "specific_dishes_or_attributes": "The chai sangria was spicy and not too sweet, which was positively received, while the food was described as decent but not impressive to a native Indian companion, indicating a negative sentiment.", "visit_purpose": "To enjoy drinks during happy hour.", "visit_purpose_reason": "The diner expresses a willingness to return for happy hour or drinks, suggesting that the primary motivation was to enjoy beverages rather than a full meal.", "quality_criteria": "The cocktails were wonderful, particularly the chai sangria, but the food was only decent and not worth the price according to a native Indian companion.", "visit_context": "The diner visited with two companions at 5 pm on a weekend.", "visit_context_reason": "The review states that the visit occurred at 5 pm on a weekend with two dining companions."}}
{"review_id": "01K9b2QKucrfFAsTcOpBLw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "I_QvvtVzEUlPm3pW68fWWg", "rating": 4.0, "timestamp": "2017-12-03 18:45:34", "review_text": "Great fusion of indian and western flavors. \n\nI had the spicy chicken and waffles which had a nice zing and my wife had the chicken tikka wrap. \n\nOnly issue was that we got there without a reservation and they said all of their tables were booked. We sat at the bar without a problem, but there were tables open the entire time we were there up until we left. Unclear why they wouldn't seat us back food was great so I\"d recommend it!", "extracted_aspects": {"cuisine_category": "fusion", "cuisine_category_reason": "The review mentions a fusion of Indian and Western flavors, indicating a preference for diverse culinary styles.", "specific_dishes_or_attributes": "The spicy chicken and waffles had a nice zing, which is a positive sentiment.", "visit_purpose": "to enjoy a meal", "visit_purpose_reason": "The diner visited the restaurant to enjoy a meal with their wife.", "quality_criteria": "The food was great, but there was an issue with seating despite tables being open.", "visit_context": "The diner visited with their wife and sat at the bar.", "visit_context_reason": "The diner and their wife arrived without a reservation and sat at the bar."}}
{"review_id": "BMp65etWDBvOLmhTHQ4jpQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "ikIT45t6zrQQ55JBoozHFw", "rating": 5.0, "timestamp": "2017-12-07 23:48:33", "review_text": "Absolutely fantastic! Great place for a date night too. The decor is beautiful and calming. The food is wonderful. You know the places where after the first bite, your eyes roll and \"mmmm\" inadvertently comes out? That's this place! I had the paneer tikka masala (my go-to dish) and it was heavenly! Not quite as spicy as I like it but the best flavor I've had in Philly (so far).", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions 'paneer tikka masala' as a go-to dish, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The paneer tikka masala was heavenly, but not quite as spicy as the diner likes.", "visit_purpose": "Date night", "visit_purpose_reason": "The review states it is a 'great place for a date night', indicating the purpose was for a romantic outing.", "quality_criteria": "The food was wonderful with the best flavor in Philly, but the spice level was not as high as desired.", "visit_context": null, "visit_context_reason": "The review does not specify who accompanied the diner or the exact timing of the visit."}}
{"review_id": "odbvee5ePedx92Ucg5jGNw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "1iMtOlXd7BRaCDejF1wZIA", "rating": 3.0, "timestamp": "2017-12-08 17:02:49", "review_text": "Among Indian food fans in the Philly area, there has been competition between IndeBlue's 2 restaurants and another chef who also has a restaurant in Philly and Jersey. Overall, I fall into the camp of IndeBlue's competitor, but I think IndeBlue does a few things very well - \n\nIndeBlue pushes the boundaries on the menu in going for Indian fusion and incorporating less traditional flavors, especially in their appetizers. You get really interesting and flavorful dishes that are great for someone looking for less traditional Indian food. The same applies to desserts, where IndeBlue has a couple inventive and really tasty options. I love the spinach chaat, liked tandoori wings, but didn't love the shrimp roti tacos. \n\nUnfortunately, there's a big mismatch with the entrees. Their main course menu is what you expect from most Indian restaurants - some of the classic North indian dishes, with many popular South Indian dishes as well. By comparison to the appetizers that you've just had, the more \"traditional\" dishes fall flat, but on their own, they also don't compare well to other upscale Indian restaurants. If you are someone who always orders the tikka masala / makhani, then I think it's not the best restaurant for you. The price is what it is, but I wouldn't call it great value for an upscale Indian spot.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review discusses Indian fusion and traditional Indian food, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The reviewer loves the spinach chaat, liked the tandoori wings, but didn't love the shrimp roti tacos.", "visit_purpose": null, "visit_purpose_reason": null, "quality_criteria": "The appetizers are interesting and flavorful, but the entrees fall flat compared to both the appetizers and other upscale Indian restaurants.", "visit_context": null, "visit_context_reason": null}}
{"review_id": "zlOq0CRX9A14C14cdMcVkg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "Qy0zhduJMSLeOaqDaXYGJQ", "rating": 4.0, "timestamp": "2017-12-11 03:19:00", "review_text": "Looking for a super filling lunch that won't break the bank? Try IndeBlu's express lunch, which allows you to select an appetizer as well as a small plate or entree for your lunch meal. The amount of food was so much for me that I had it packed up and had dinner later on!\n\nFor my appetizer I selected the tandoori chicken naan pizza. To be honest, it wasn't exactly what I was expecting - if I hadn't known that the pizza was made with naan, I wouldn't have had any clue. It seemed just like a regular personal sized pizza. It was tasty, with a little bit of Indian seasonings and delicious peppers, in addition to the chicken and cheese.\n\nFor my entree, I got the chicken makhani. To be honest, I really didn't have much of a clue what I was ordering, I just know that I like chicken, and figured I'd give it a shot. The menu I had didn't mention that it was a \"butter chicken\" dish, which might have given me a better idea. Nonetheless, I thought that the chicken was delicious and flavorful, and just the right tenderness with the meat. The rice was a bit on the bland side, but the sauce on the chicken made up for it. \n\nAll in all, the food here was pretty good - my husband ordered the chicken madras, which I sampled and we both agreed that the makhani was far better. So if you're visiting, I'd definitely recommend that dish. Can't wait to come back and try a bit more of the menu!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like tandoori chicken naan pizza and chicken makhani, which are indicative of Indian cuisine.", "specific_dishes_or_attributes": "The tandoori chicken naan pizza was tasty with Indian seasonings and delicious peppers, while the chicken makhani was delicious and flavorful with the right tenderness, but the rice was bland.", "visit_purpose": "To have a filling and affordable lunch.", "visit_purpose_reason": "The diner was looking for a filling lunch that is affordable, as indicated by the mention of a super filling lunch that won't break the bank.", "quality_criteria": "The chicken makhani was delicious and flavorful, but the rice was bland.", "visit_context": "The diner visited with their husband for lunch.", "visit_context_reason": "The review indicates that the diner was with their husband and mentions having lunch, suggesting a casual dining experience."}}
{"review_id": "x4VAYIokbiVoSSHjVk7XOg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "d0xjrf1CL0ollZNK5xewWg", "rating": 4.0, "timestamp": "2017-12-11 21:22:53", "review_text": "This is a review for brunch only, as I have not been here for dinner yet.\n\nI love indian food and was looking for someplace new for brunch that is vegan friendly. A quick yelp search suggested that IndeBlue would be just the place.\n\nSundays they have live music, which was nice. However, we were sitting right across from the music, and it did get a little loud at times. Something to maybe note when you request reservations. \n\nOur reservation was for 11:45 or 12, and it really filled up in the next hour or so - so making a reservation is a good bet. I ordered the rose mimosa (like rose, the flower) for $6. It was really delicious! (They do unlimited for $22, FYI.)  We started with the crispy spinach chaat which is vegan if you don't get the yogurt sauce. It was amazing, so order this for sure. The cauliflower was also really great (and vegan friendly). My vegan friend ordered some sort of vegan dosa roll. I ordered the paneer bhurjee, which was really amazing - with the indian paneer cheese. My other friend got the chicken and waffles, which is huge and seriously really amazing. \n\nI will definitely keep this in my mind for future brunches (and if your friends aren't into indian, they will definitely find something here). I also really look forward to coming back here and trying out some happy hour or dinner dishes.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner explicitly states, 'I love indian food' which indicates a preference for Indian cuisine.", "specific_dishes_or_attributes": "The crispy spinach chaat was amazing, and the paneer bhurjee was really amazing.", "visit_purpose": "To find a new vegan-friendly brunch spot.", "visit_purpose_reason": "The diner mentions looking for 'someplace new for brunch that is vegan friendly'.", "quality_criteria": "The crispy spinach chaat and paneer bhurjee were amazing, while the live music was a bit loud at times.", "visit_context": "The visit was for brunch on a Sunday with friends.", "visit_context_reason": "The diner mentions making a reservation for brunch at 11:45 or 12 on a Sunday."}}
{"review_id": "d2S_CpK46Vm6DryVzOVNew", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "NV5EoM92xLRhf1r-dD7txA", "rating": 5.0, "timestamp": "2017-12-18 00:25:19", "review_text": "One of the best Indian restaurants I've ever dined at, excellent service and food was delicious! I had the moilee which had jumbo shrimp and lump crab meat in a coconut and mustard curry, soooo good. If you are a novice to Indian food you should definitely go here to try it.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review explicitly mentions 'Indian restaurants' and 'Indian food'.", "specific_dishes_or_attributes": "The moilee, which had jumbo shrimp and lump crab meat in a coconut and mustard curry, was described as 'soooo good'.", "visit_purpose": "To introduce novices to Indian food.", "visit_purpose_reason": "The reviewer suggests that novices to Indian food should try this restaurant, indicating a motivation to introduce others to the cuisine.", "quality_criteria": "The service was excellent and the food was delicious.", "visit_context": null, "visit_context_reason": "The review does not specify who the diner was with or when the visit occurred."}}
{"review_id": "iuVoAYh_RlYQsd9BuUq8gg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "wVPF_WLxXgKzmaIreX415A", "rating": 5.0, "timestamp": "2018-01-02 02:46:28", "review_text": "This is my favorite Indian restaurant in the city. We got their spinach appetizer which was out of this world! The samosas are also excellent. Having never been to an Indian fusion place I didn't know what to expect. I was super happy with the results.  Also, as a person who enjoys very spicy food, I was able to request really spicy curry and was not disappointed.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review explicitly mentions the restaurant as an Indian restaurant and discusses specific Indian dishes.", "specific_dishes_or_attributes": "The spinach appetizer was 'out of this world' and the samosas are described as 'excellent'.", "visit_purpose": null, "visit_purpose_reason": "The review does not specify a particular reason for the visit.", "quality_criteria": "The reviewer was very pleased with the spinach appetizer and samosas, but does not mention any negative aspects.", "visit_context": null, "visit_context_reason": "The review does not provide specific details about who visited or when."}}
{"review_id": "mMedEw8kcNb1sQkpc1G7Hg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "OTeVV3oqdwXpyJ9KbWIPxg", "rating": 5.0, "timestamp": "2018-01-04 04:05:44", "review_text": "Favorite part is the drinks. Always take guests there and they love it!! Food is great too. Love the spinach chaat", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner expresses enjoyment of specific dishes and attributes, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The diner loves the spinach chaat, indicating a positive sentiment towards this specific dish.", "visit_purpose": "To entertain guests", "visit_purpose_reason": "The diner mentions always taking guests there, suggesting the purpose is to entertain or impress visitors.", "quality_criteria": "The drinks are favored, and the food is described as great, indicating a positive sentiment overall.", "visit_context": "The diner visits with guests", "visit_context_reason": "The diner mentions taking guests there, implying a social context."}}
{"review_id": "Sttkt1AnnzYWMatgFVgZnQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "KnRAilT8d_88vUODqcZtVw", "rating": 5.0, "timestamp": "2018-01-08 20:33:38", "review_text": "Fantastic happy hour with great small plates and drinks. It's on the street with some of the best happy hours in Philly, and Indeblue certainly delivers. The seating is intimate whether at the bar or in their main dining room; and if you come anytime after 5pm, you can sit by the bar and try out a variety of different indian fusion dishes. In addition to a $4 daily draft, they have 6 $6 cocktails, all of which are deliciously balanced and decently potent; the shrub of the moment with whiskey and the ginger jadoo in particular are excellent. As for small plates, everything is a decent portion ranging from $3-5, and you can never go wrong with things like the spinach chaat, crispy cauliflower, drums of heaven, tikka naan pizza, and stuffed long hots. The only downside is that it's bar seating only, which is a limited 13 seats, and it gets filled up very quickly. But if you're able to nab a spot, you'll be rewarded with finely crafted cocktails and some tasty bites, enough to have a reasonable dinner or date night, at a great price.", "extracted_aspects": {"cuisine_category": "Indian Fusion", "cuisine_category_reason": "The review mentions 'indian fusion dishes' and specific items like 'spinach chaat' and 'tikka naan pizza'.", "specific_dishes_or_attributes": "The 'spinach chaat' and 'tikka naan pizza' are highlighted as tasty options.", "visit_purpose": "To enjoy happy hour with small plates and drinks.", "visit_purpose_reason": "The review suggests that the diner is looking for a place to enjoy happy hour and small plates.", "quality_criteria": "The cocktails are described as 'deliciously balanced and decently potent', while the limited bar seating is seen as a downside.", "visit_context": "The visit is after 5pm and involves bar seating.", "visit_context_reason": "The review indicates that the visit occurs after 5pm and involves bar seating."}}
{"review_id": "NXR3o-UIQp5_gxfZ8p12yA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "ZMzaOGUlCXY6kWXEnHZbvQ", "rating": 5.0, "timestamp": "2018-01-10 02:16:48", "review_text": "Philly isn't known for its Indian food, but Indeblue is hands down the best option in the city. It is an upscale restaurant with a beautiful ambiance in the heart of Center City. The food is incredible and service is knowledgeable and fantastic. Tables aren't terribly difficult to get so I don't think you even need to make a reservation unless it's during prime brunch hours. Happy hour offerings are terrific. The tikka naan pizza here is the bomb and a great deal at $5! Their express lunch is also great at $15. Their spinach chaat is very popular but I'm not a fan. Personal menu highlights: chicken madras, chicken makhani, and tikka naan pizza. I've also ordered catering from here for a school event and it was executed smoothly. 5/5", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review specifically mentions Indian food as the type of cuisine offered at the restaurant.", "specific_dishes_or_attributes": "The tikka naan pizza here is the bomb and a great deal at $5, while I'm not a fan of the spinach chaat.", "visit_purpose": "Catering for a school event", "visit_purpose_reason": "The review mentions ordering catering for a school event, indicating a specific purpose for the visit.", "quality_criteria": "The food is incredible and service is knowledgeable and fantastic, but I'm not a fan of the spinach chaat.", "visit_context": null, "visit_context_reason": "The review does not specify who visited or when, only mentioning a school event."}}
{"review_id": "U7tWhuTjznhDYnrm0inzGw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "bxm90XH7RT4QhSZeiM1kaw", "rating": 3.0, "timestamp": "2018-01-23 01:41:55", "review_text": "Let me first say, I'm new to Indian food. We're in the beginning stages of what I am sure will be a life long love affair, but at this point I'm certainly no expert in the cuisine. What I really love about Indian so far is its rustic-ness and its stewed meats that take nothing but patience and love. Indeblue did not strike me as rustic in the slightest, this was a more refined, modernized Indian that lost some of that comforting hominess I've come to enjoy. I came to Indeblue with a group of friends for brunch during restaurant week. While I enjoyed my meal, I definitely wasn't blown away like I have been at the cozier family run Indian spots. \n\nFor starters I got the spinach chaat. Dare I say this was like a fried salad. Literally little baby spinach leaves in a very very light batter fried until crisp. It was topped with some sauces, a sweet chile sauce and a creamy sauce. I've never had anything like this, it was delicious albeit not very filling. \n\nFor my entree I got the spicy chicken and waffles. I was honestly pretty let down by this. Don't get me wrong, it was good. The waffles were made well, the chicken was juicy and crispy. But they really failed to deliver on the spice. There was a sriracha drizzle and that was it. I don't need my palate burned out, but if you say spicy I want some spice. Not even necessarily heat spice, Indian chefs are literally masters of balancing spices. Even if it just had some cumin or curry in the batter, that would have made this stand out. \n\nDessert was a flight of some little goodies. I did really enjoy these perfect little bites to end the meal. The first was a rice pudding with some pistachios, the second a little banana donut doused in a luxurious caramel and finally a thick chocolate mouse covered in coconut. \n\nOverall this was an enjoyable meal but not a \"run don't walk\" here kind of place. With that said, I wouldn't mind coming back for the full menu not during restaurant week.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner expresses a newfound interest in Indian food, indicating a preference for rustic and comforting dishes.", "specific_dishes_or_attributes": "The spinach chaat was delicious albeit not very filling, while the spicy chicken and waffles were good but let down by a lack of spice.", "visit_purpose": "To explore new dining experiences during restaurant week.", "visit_purpose_reason": "The diner visited during restaurant week, which suggests a motivation to explore new dining experiences.", "quality_criteria": "The meal was enjoyable overall, but the diner felt that the spicy chicken and waffles were disappointing due to a lack of spice.", "visit_context": "The diner visited with a group of friends for brunch.", "visit_context_reason": "The diner mentioned being with a group of friends for brunch, indicating the social context of the visit."}}
{"review_id": "Ig9ujQfr9kUA0qT_UNuqyA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "NVk8zYPSJUnsIOrXUui20A", "rating": 2.0, "timestamp": "2018-01-28 03:20:25", "review_text": "Lol wtf. Before I say anything, as a disclaimer I did come during restaurant week for dinner so the menu is quiet different from the regular menu. As a vegetarian I'm personally offended that an India restaurant doesn't have more vegetarian options. Especially when about half of the Indias population is vegetarian. For starters the gave us a plate of papad with dipping sauce and it was alright nothing too special. The shorba I think was a little bland, it lacked flavor and it was the 2nd course. The dinner was some kind of eggplant curry with naan and basmati rice. The haaka noodles we ordered as our second dinner dish were REALLY bad. Like did the chef even put any effort into it? It was bland and tasted inedible. The dessert consisted of Julab Jamun which was delicious. \n\nSo, over all I don't think I would ever come back to this place for restaurant week because I feel like they literally didn't put any effort. Our bill was more than 100+ for two people. Should've gone to McDonald's", "extracted_aspects": {"cuisine_category": "Vegetarian", "cuisine_category_reason": "The diner expresses disappointment regarding the lack of vegetarian options at an Indian restaurant, indicating a preference for vegetarian cuisine.", "specific_dishes_or_attributes": "The diner found the shorba to be bland and lacking flavor, and described the haaka noodles as REALLY bad and inedible.", "visit_purpose": "To participate in restaurant week.", "visit_purpose_reason": "The diner visited during restaurant week, which typically offers a special menu.", "quality_criteria": "The diner found the papad to be alright, the shorba bland, the haaka noodles inedible, and the dessert Julab Jamun delicious.", "visit_context": "The diner visited during restaurant week for dinner.", "visit_context_reason": "The diner mentions coming during restaurant week for dinner."}}
{"review_id": "bO1CtmdcUOyAUbgzrt43tw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "UF93ng54bB4981krwCMmKw", "rating": 5.0, "timestamp": "2018-01-29 15:59:58", "review_text": "This restaurant was amazing! I visited during restaurant week and I'm so glad i did. This is a lovely Indian cuisine restaurant with such a pleasant and sophisticated atmosphere. Our waiter was very nice as he described our dinner choices. The food tasted very well and I was happy with our meal choices. I would definitely recommend the chicken meatballs and the crispy spinach dishes. The bathroom was nice as well, it looked recently remodeled and it had a silhouette door! Very classy place and I will be visiting again.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review explicitly mentions 'Indian cuisine' as the type of food served at the restaurant.", "specific_dishes_or_attributes": "The reviewer positively judges the chicken meatballs and the crispy spinach dishes, stating they would definitely recommend them.", "visit_purpose": "To enjoy a special dining experience during restaurant week.", "visit_purpose_reason": "The diner visited during restaurant week, which suggests a motivation to explore special offerings or promotions.", "quality_criteria": "The food tasted very well, and the bathroom was nice and recently remodeled, indicating a positive experience overall, but there is no negative judgment mentioned.", "visit_context": "The diner visited during restaurant week.", "visit_context_reason": "The review states that the diner visited during restaurant week, providing a specific timeframe for the visit."}}
{"review_id": "uvWOCDtWePNq348Q4RqzbQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "vJieIrViZqkj29vHNGKM8Q", "rating": 5.0, "timestamp": "2018-02-05 17:45:33", "review_text": "Love!!! I was there Saturday night with my boyfriend.  You could honestly walk right by this place, but the outside is not a true reflection of the sleek, ambient, Indian-with-a-modern-twist vibe that exists in there.  It was even romantic, I'd say.  \n\nI love Indian food, but am also pretty new to it, so I was interested to see what IndeBlue's take on it was.  We were not disappointed!  Started off with a bourbon, lemon, honey, lavender cocktail, which was on point.  The cocktail menu itself was very nice.  For an appetizer, had somewhat of a paneer bruschetta, which was outstanding, and also a really fun play on traditional bruschetta.  Entrees were delicious as well - definitely reminiscent of your favorite Indian take out dish, but with lovely, fresh, and exotic ingredients, served super elegantly.  Dessert menu was also very fun!\n\nI read some reviews on here complaining about the food here, and I, quite frankly, don't get it.  Hoepfully no one comes in here expecting a fully traditional Indian experience...This is a beautiful, fun, twist on the flavors and dishes you know and love.  :)", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner expresses a love for Indian food and appreciates a modern twist on traditional Indian dishes.", "specific_dishes_or_attributes": "The paneer bruschetta was outstanding and a fun play on traditional bruschetta.", "visit_purpose": "To explore a modern interpretation of Indian cuisine.", "visit_purpose_reason": "The diner was interested in experiencing IndeBlue's take on Indian food.", "quality_criteria": "The cocktail was on point, the appetizers and entrees were delicious with lovely, fresh, and exotic ingredients, but the diner notes that some may not appreciate the non-traditional approach.", "visit_context": "The diner was there Saturday night with their boyfriend.", "visit_context_reason": "The diner visited on a Saturday night with their boyfriend."}}
{"review_id": "tp0HiIwl4pnAnSeRZLBG8A", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "_uXsvqMJYALJLaP0DaCWsw", "rating": 5.0, "timestamp": "2018-02-07 13:49:39", "review_text": "Sophisticated, classy and wonderful are the words I'll use to describe my experience here at Indeblue. Those words describe the ambience as well as the food. Indeblue, I'm truly impressed!\n\nI came here during restaurant week, and the scenery was slightly crowded, the lights were dim and there were candles on every table. I also noticed artsy paintings on the wall and just a overall eclectic setting and vibe.\n\nOur waiter was very nice, he thoroughly went over the menu. We started off with an assorted cheese tray, which featured of course, cheese, grapes, these delicious tasting crackers, cashews and three different sweet spreads.\n\nWe also had the crispy spinach chaat, spiced chicken meatballs with basmati rice and naan bread for dinner. Lastly we had an assorted tray of small desserts. \n\nEverything was delicious here at Indeblue, the spices that they use on the food is divine. It's like a blend of sweet and savory.  I thoroughly enjoyed my time here, service was efficient and I can't wait to go back, especially to try those poutine fries and brunch!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like spiced chicken meatballs and crispy spinach chaat, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The assorted cheese tray was delicious, and the spices used on the food were divine.", "visit_purpose": "To enjoy a special dining experience during restaurant week.", "visit_purpose_reason": "The diner visited during restaurant week, which typically encourages trying new restaurants and dishes.", "quality_criteria": "The food was delicious with divine spices, but the scenery was slightly crowded.", "visit_context": "The diner visited during restaurant week.", "visit_context_reason": "The review states that the diner came during restaurant week and describes the ambiance as crowded with dim lights and candles."}}
{"review_id": "aaweG_nljZcCqfmX-zgJ3A", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "blZo3kFBqi_DTqLXtY5_vw", "rating": 5.0, "timestamp": "2018-02-13 22:07:06", "review_text": "I've been here a few times and each visit has been great! Everything about the experience is great, between the ambience, the waiters and the food. The Channa masala is my favorite, and if you ask for it to be spicy, they really deliver. The happy hour is a great value and for brunch they have unlimited mimosas for 20 bucks with is a great deal", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions Channa masala, which is a dish from Indian cuisine.", "specific_dishes_or_attributes": "The Channa masala is my favorite, and if you ask for it to be spicy, they really deliver.", "visit_purpose": "To enjoy great food and value during happy hour and brunch.", "visit_purpose_reason": "The review highlights the great value of happy hour and brunch offerings.", "quality_criteria": "The ambience, waiters, and food are all described as great, indicating a positive overall experience.", "visit_context": "The reviewer has visited the restaurant a few times.", "visit_context_reason": "The reviewer states they have been there a few times, indicating multiple visits."}}
{"review_id": "7GOZrQI-5gT_IJUmTPHOQw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "8i1JQUKgH-3hcFfnp0JAIQ", "rating": 3.0, "timestamp": "2018-02-14 14:06:16", "review_text": "Restaurant Week Review:\nWent here on Friday night with a restaurant week reservation. The restaurant itself is cute and intimate. It was of course very busy because of restaurant week and there was a set menu which consisted of a cheese board, two starters, and two entrees, and dessert. Being vegan, I consulted the waitress around my options. She was very gracious and altered a number of the items to meet my needs, as well as keep the non vegan items for my date. Though it was very accommodating, I felt a bit as though she was making a spectacle of my dietary choices, for example, making a big point every time something vegan was brought to the table, and I began to feel a little embarrassed. \nThe food itself was good, though I found the cheese board to feel out of place at an Indian restaurant. There was a very large gap of time between our starters and our mains which I attribute to the crowd. In total we were there about 2 hours for dinner which I found to be abnormal. \nI will need to return outside of restaurant week to see if the experience is comparable.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner identifies the restaurant as an Indian restaurant.", "specific_dishes_or_attributes": "The cheese board felt out of place at an Indian restaurant, indicating a negative sentiment towards that specific dish.", "visit_purpose": "To participate in restaurant week.", "visit_purpose_reason": "The diner mentions having a restaurant week reservation, which indicates a specific event-driven purpose for the visit.", "quality_criteria": "The food was good, but the long wait time between starters and mains was abnormal.", "visit_context": "The diner visited on a Friday night.", "visit_context_reason": "The diner went on a Friday night and was there for about 2 hours."}}
{"review_id": "FR2-eHNkeIjmwkT7_O_VoA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "KTxe33TKY86VJRm41iBm1A", "rating": 4.0, "timestamp": "2018-02-15 15:43:39", "review_text": "IndeBlue is fabulous, the perfect place for a special occasion! I came here for the Valentine's Day 4 course tasting menu. The ambiance is classy and chic. They were handing out roses - a nice touch.\n\nI had the rose gimlet - a great cocktail, not too sweet. The food was phenomenal! I'm not a connoisseur of Indian food, but every dish was rich, warm, and flavorful. I picked the mushroom dosa to start (a lentil crepe filled with shrooms) topped with an interesting blue cheese cream sauce. I then had the \"jewel of the sea\" dish as my entree (medley of seafood in a delicious coconut curry). Both were perfectly prepared! I left so contently full and definitely excited to come back and try brunch or the regular menu.\n\nPro tip: if you ask for spicy, they deliver!! So make sure you specify what level you're looking for.\n\nGiving 4 stars instead of 5 mostly due to pricing ($60/person) considering naan and a small dessert were 2 of 4 courses.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner mentions enjoying Indian food and describes the dishes as rich, warm, and flavorful.", "specific_dishes_or_attributes": "The mushroom dosa was topped with an interesting blue cheese cream sauce and was flavorful, while the 'jewel of the sea' dish was a medley of seafood in a delicious coconut curry and was perfectly prepared.", "visit_purpose": "To celebrate a special occasion.", "visit_purpose_reason": "The diner specifically states they came for the Valentine's Day 4 course tasting menu.", "quality_criteria": "The food was phenomenal and perfectly prepared, but the pricing was considered high for the amount of food served.", "visit_context": "The diner visited on Valentine's Day.", "visit_context_reason": "The review indicates it was Valentine's Day and mentions the ambiance and special touches like roses."}}
{"review_id": "d-Oox_nAUGg29unx1r9AbA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "952KmRM_GT06hAW_v7ZPoQ", "rating": 5.0, "timestamp": "2018-02-27 14:54:15", "review_text": "Good Indian food. I had originally preferred the NJ location but I heard its closing. Nice date night place, enchanting atmosphere, and pleasant staff.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review explicitly mentions 'Good Indian food.'", "specific_dishes_or_attributes": "The diner describes the Indian food as 'Good.'", "visit_purpose": "Date night", "visit_purpose_reason": "The review indicates it was a 'Nice date night place.'", "quality_criteria": "The atmosphere is described as 'enchanting' and the staff as 'pleasant,' indicating positive sentiments, but there is no negative judgment mentioned.", "visit_context": null, "visit_context_reason": "The diner mentions a preference for the NJ location, suggesting a prior experience, but does not specify who they were with or the exact timing of the visit."}}
{"review_id": "IxZmGFHwelMJl0osyeYbOw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "-ZUH1J9f2bkb92jdJym8FA", "rating": 4.0, "timestamp": "2018-03-01 17:29:24", "review_text": "My roommates and I came to IndeBlue for Restaurant Week Brunch. We immediately liked how the restaurant was decorated - the wall decorations were beautiful and the atmosphere was great (casual yet traditional and classy). However, maybe because it was restaurant week, the restaurant was very loud and crammed. Below are the dishes we tried. The restaurant week menu allowed each of us to order an appetizer, an entree, and a dessert (which was the same for everyone) \n\nAppetizers:\n- Crispy Spinach Chaat: 4.5/5 - The flavor and texture were so great in this dish. It was just salty enough and the crispiness was perfect. The sauce drizzled on top was great and this dish is great to share. Definitely recommend!\n- Vegetable Samosa Chaat: 3.5/5 - A pretty standard samosa with a nice filling and crunchy wrapping. The chickpeas served with the chaat were great! \n- Crispy Cauliflower: 3.5/5 - This cauliflower sort of tasted like buffalo sauce. It was really creative but the breaded coating was too thick for me personally.  \n\nEntrees: \n- Chicken and Waffles: I can't give a rating for this one since I didn't try it but my roommates who ordered this dish really enjoyed it. They were extremely impressed with the dish and said it was very filling as well. \n- Chole Bhature: 4/5 - The bhatura was really delicious - fluffy and soft. I am a huge fan of chickpeas so I ordered this dish. It was pretty good but nothing super unique or creative. \n\nDessert:\n- Dessert Sampler Trio: 4/5 - The three desserts were a scoop of chocolate mousse, gulab jamun (fried dough ball soaked in syrup), and a rice pudding. I really liked all three! The chocolate mousse was rich and not to sweet while the gulab jamun was very fluffy and light on the inside. The rice pudding was also not too sweet. It was nice to be able to try all three! \n\nOverall, Indeblue is a great spot for a modern and fun Indian cuisine. A great place to come with friends for a casual yet nice meal.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions 'modern and fun Indian cuisine' as the overall description of the restaurant.", "specific_dishes_or_attributes": "The Crispy Spinach Chaat had great flavor and texture, being just salty enough and perfectly crispy, which the diner positively highlighted.", "visit_purpose": "To participate in Restaurant Week Brunch.", "visit_purpose_reason": "The review states they visited for 'Restaurant Week Brunch', indicating a special event.", "quality_criteria": "The atmosphere was great and beautifully decorated, but the restaurant was very loud and crammed during the visit.", "visit_context": "The diner visited with roommates during Restaurant Week Brunch.", "visit_context_reason": "The review mentions that the diner was with 'roommates' and specifies it was for 'Restaurant Week Brunch'."}}
{"review_id": "Po4jUR02umw-AtSSdrwXgw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "D_ht1CPEJlS4v0iYmJ9mcg", "rating": 5.0, "timestamp": "2018-03-05 16:16:06", "review_text": "One of my favorite places ever!!!! This is the best Indian food in the city hands down. Definitely worth going with a big group and getting the tasting menu- it's out of this world!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review explicitly states that the diner believes this restaurant serves the best Indian food in the city.", "specific_dishes_or_attributes": "The tasting menu is described as 'out of this world' indicating a very positive sentiment.", "visit_purpose": "Social dining with a group.", "visit_purpose_reason": "The reviewer suggests that it is worth going with a big group, implying a social dining experience.", "quality_criteria": "The Indian food is praised as the best in the city, indicating a strong positive sentiment.", "visit_context": null, "visit_context_reason": "The review does not specify who the diner visited with or when the visit occurred."}}
{"review_id": "JCHk2IhoV0cKZXKolGVTDA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "rAgCPqxaQKgd7XQVhePBeA", "rating": 4.0, "timestamp": "2018-03-09 21:55:21", "review_text": "A group of 4 of us had reservations for a saturday night.  Upon entry we found a much larger space than would appear from outside, but not a big place by far.  A but of a tight squeeze between very full tables!  We only stayed for a glass of wine and a couple apps, but the menu looked delicious! I really hope to return and sample some of their many vegetarian & vegan offerings.\n\nWhat we did have: \nThe cauliflower: A+++ as long as you like cauliflower\nthe stuffed long hot peppers: C.  I wanted to love this but I just didn't, and neither did anyone else at the table!\nThe naan special, which was a sun dried tomato jawn.  A for this, it was delicious. \n\nService: left a little to be desired. While our server was very nice and all, there were 2 problems: bad breath and oversharing about personal problems.  A little chit chat is fine but it was over the top. You know what I mean.  Loss of star was for that and the long hots.\n\nI hope to go back and get a different server and more servings! *bah dum ch!*", "extracted_aspects": {"cuisine_category": "Vegetarian & Vegan", "cuisine_category_reason": "The diner expresses a desire to return and sample vegetarian and vegan offerings, indicating a preference for these types of cuisine.", "specific_dishes_or_attributes": "The cauliflower received an A+++ rating, indicating a strong positive sentiment, while the stuffed long hot peppers received a C, indicating a negative sentiment.", "visit_purpose": "To sample more dishes, particularly vegetarian and vegan options.", "visit_purpose_reason": "The diner mentions hoping to return to sample more dishes, suggesting their primary motivation is to enjoy more food.", "quality_criteria": "The service was negatively impacted by the server's bad breath and oversharing, while the food quality was mixed with the cauliflower and naan being rated positively and the stuffed long hot peppers rated negatively.", "visit_context": "A group of 4 visited on a Saturday night.", "visit_context_reason": "The review states that the diner visited with a group of 4 on a Saturday night, which provides clear context."}}
{"review_id": "cgQcb3ERzUex0j6wcxpHzQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "PsBVn_Zhk5LxF95b0nif0g", "rating": 5.0, "timestamp": "2018-03-18 23:35:37", "review_text": "Great atmosphere and delicious brunch. The Indian fusion restaurant has meals to please all. We split the masala dosa which was rich in flavor and had great dipping sides. For our main course we had the thali platter. It was served with rice and naan and surrounded by a slew of curries and dessert. Can't wait to go back and try something else.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions 'Indian fusion restaurant' and specific Indian dishes like 'masala dosa' and 'thali platter'.", "specific_dishes_or_attributes": "The masala dosa was rich in flavor and had great dipping sides.", "visit_purpose": "To try more dishes.", "visit_purpose_reason": "The diner expresses excitement about returning to try more dishes.", "quality_criteria": "The atmosphere was great and the brunch was delicious, but there are no negative judgments mentioned.", "visit_context": "Brunch.", "visit_context_reason": "The review does not specify who visited or when, only that it was a brunch."}}
{"review_id": "rcrwtlGKhtRDuwHeSDgzmQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "kj-jdhOYqi85101EEu1kTg", "rating": 5.0, "timestamp": "2018-03-19 19:02:34", "review_text": "Came here with a group of 7 for a women's brunch. We had placed a reservation for brunch which many places in the city don't take. I got the egg, sausage and potato vindaloo and it was bomb. The sausage was so tender it was fluffy, egg and potato were also soft. Not sure what the sauce was but with the herbs it was so flavorful. I was SO full afterwards. I also had the rose mimosa which was pleasantly sweet and carbonated. The waiter was friendly and attentive; not a glass was empty. The atmosphere was nice as there was enough background noise that it felt friendly but not overly loud. Would def come again for the brunch. Also, the price is good for what you're getting.", "extracted_aspects": {"cuisine_category": "Hearty brunch dishes", "cuisine_category_reason": "The diner enjoyed a dish that includes egg, sausage, and potato with a flavorful sauce, indicating a preference for hearty, flavorful dishes.", "specific_dishes_or_attributes": "The egg, sausage, and potato vindaloo was bomb, with the sausage being tender and fluffy, and the overall dish being flavorful.", "visit_purpose": "Brunch with a group", "visit_purpose_reason": "The diner specifically mentions they came for brunch with a group, indicating the primary motivation.", "quality_criteria": "The food was flavorful and satisfying, but the review does not mention any negative aspects.", "visit_context": "Came with a group of 7 for a women's brunch", "visit_context_reason": "The diner states they came with a group of 7 for a women's brunch and had made a reservation."}}
{"review_id": "oAV1tDHB4kwHwbqdlldj9A", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "YPvfXRsIYVgrenwau4-aFw", "rating": 4.0, "timestamp": "2018-03-27 15:07:51", "review_text": "Came here on a spontaneous night out for dinner and everything from the wait staff to the food was amazing! \n\nEveryone was very friendly and attentive and the chef went over to every table thanking people for their service ( when truly we should be instead). We ordered the paneer tikka and Malai kofta and both were amazing!\n\nA tip would be to ask for the food spicy if you're a person who needs that extra flavor because the food in general had almost no spice. Also the food, which they say can be shareable, is really not unless you have a small appetite. As a person who loves to eat, I could've finished two of the entrees \n\nOverall though, a great experience! A little pricey for your traditional mainstream Indian food, but nonetheless, highly recommended!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review specifically mentions 'paneer tikka' and 'Malai kofta', which are traditional Indian dishes.", "specific_dishes_or_attributes": "The paneer tikka and Malai kofta were both amazing.", "visit_purpose": "Dinner", "visit_purpose_reason": "The review states it was a 'spontaneous night out for dinner'.", "quality_criteria": "The wait staff was friendly and attentive, but the food had almost no spice and was a little pricey for traditional mainstream Indian food.", "visit_context": "Spontaneous night out for dinner", "visit_context_reason": "The review indicates it was a spontaneous night out, suggesting a casual dining experience."}}
{"review_id": "9lJCjZ0izLYtQ5in8R71Ww", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "n8TgUTVW8J6oZNYEKar0fA", "rating": 3.0, "timestamp": "2018-04-01 00:05:59", "review_text": "I wanted to like IndeBlue's happy hour but it honestly just wasn't that impressive. I think the only thing that I enjoyed was the spinach chaat (which was REALLY good!! could eat a whole plate of that!) Drums of Heaven were ehhhh and the tikka naan pizza just tasted like regular pizza. Portions were tiiiiinyyyyyy TINY, but that's fine, I guess, since it's happy hour.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner mentions specific dishes such as spinach chaat, Drums of Heaven, and tikka naan pizza, which are indicative of Indian cuisine.", "specific_dishes_or_attributes": "The spinach chaat was REALLY good, while the Drums of Heaven were ehhhh and the tikka naan pizza just tasted like regular pizza.", "visit_purpose": "To experience happy hour.", "visit_purpose_reason": "The review mentions 'happy hour,' indicating a specific time and reason for the visit.", "quality_criteria": "The portions were tiiiiinyyyyyy TINY, but the spinach chaat was really good.", "visit_context": "The visit occurred during happy hour.", "visit_context_reason": "The diner does not specify who they were with or the exact time, but they reference happy hour as the context."}}
{"review_id": "MFyVC9gcCsG8CWnwEYz_gw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "5vQ6JC8ytvurd4f3yhqdyw", "rating": 5.0, "timestamp": "2018-04-01 20:51:55", "review_text": "Indian food art noveau. Everything on our table that included rose mimosas, thali sampler, chicken dishes, and vindaloo skillet were imbibed and ingested well. Everything was excellent. The only problem was trying to decide which dish. Seems like a great place for dinner and HH as well. Brunch was excellent with live Indian music playing. Service was excellent. Highly recommend! Looks like this picky eater has found a good Indian oasis. Warning to those who love vindaloo---I've heard from my fellow dining patrons that it is not that spicy as vindaloo is expected to be. Nevertheless, all excellent and satisfying to the palate!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review explicitly mentions 'Indian food' as the type of cuisine enjoyed.", "specific_dishes_or_attributes": "The thali sampler and chicken dishes were imbibed and ingested well, and everything was excellent.", "visit_purpose": "To enjoy a meal with friends or family during brunch and dinner.", "visit_purpose_reason": "The review indicates that the diner enjoyed brunch and dinner, suggesting a social or leisurely purpose.", "quality_criteria": "The service was excellent, and while the vindaloo was not as spicy as expected, everything else was excellent and satisfying to the palate.", "visit_context": "The diner visited for brunch and dinner with friends or family.", "visit_context_reason": "The review mentions enjoying brunch with live Indian music and implies a social setting."}}
{"review_id": "3Eo140j9SBZDDE_ydjsztA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "z393W1wNCBtcM-fNYIv_mw", "rating": 4.0, "timestamp": "2018-04-14 17:17:33", "review_text": "VISIT HISTORY: \n- Last visit: yesterday night for dinner with a friend \n- Frequency: been here 3-4x, mostly for their happy hour \n- Next visit? The daily happy hour by the bar is pretty solid so will probably return for that \n\nFOODRINK:\n*Disclaimer: used to work at an Indian restaurant so I am picky*\n\n- Crispy Spinach Chaat: actually very crispy! Amount of chutney is lighter than usual but the tamarind chutney was pretty good.\n- Crispy Cauliflower: felt like fried chicken but not quite. Cant quite taste the soy but overall seasoned very well \n- Paneer Tikka Masala: I love love housemade paneer. By the time we ate the two appetizer, I should t have eaten all the paneer Tikka but I did. I'd put the creamy level as above average. The onions pieces were pretty big. \n- Garlic naan: we had one buttered and one non-buttered. Smaller size than what I am used to. \n- Gulab Jamun: it's one of my favorite Indian desserts after Ras Malai. It looked like a cut up almond in its westernized facade but it tasted really good. I was expecting it to be soaked in its sweet glorious syrup but it came out very different. Still tasted like Gulab Jamun. I want one now... \n\nVIBE:\n- Slightly under upscale \n- Dim lighting. If you messed up your eyeliner or make up, don't worry you'll still look beautiful and nobody will know \n- Waiter asked if we needed refill 4-5x but honestly I got the vibe he liked my friend so maybe it was a flirtation disguised in service \n- Not much noise even though the restaurant is almost full that night \n- Smells phenomenal\n- Wait time for food arrival: 2 minutes 18 seconds (for appetizer) 27 minutes 2 seconds (for the entree so +/- 2 minutes after the arrival of the appetizer)\n- Wait time for our check: almost immediate after we devoured dessert", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review focuses on Indian dishes and flavors, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The reviewer found the Crispy Spinach Chaat to be very crispy but noted that the amount of chutney was lighter than usual.", "visit_purpose": "To enjoy happy hour.", "visit_purpose_reason": "The diner mentioned they have been to the restaurant mostly for their happy hour, indicating that this was a primary motivation for the visit.", "quality_criteria": "The Paneer Tikka Masala was described as having above-average creaminess, but the reviewer noted that the onion pieces were pretty big, which could be seen as a negative aspect.", "visit_context": "Dinner with a friend last night.", "visit_context_reason": "The review states that the last visit was yesterday night for dinner with a friend, providing clear context."}}
{"review_id": "6FPOThoUXRfe_EnXsumJ1w", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "YUqJTee3dXnTuPT_hZa5Pw", "rating": 5.0, "timestamp": "2018-04-15 00:47:45", "review_text": "This is a regular stop for my husband and me.  We've always enjoyed the food, and the service is good for the most part.  Would highly recommend.", "extracted_aspects": {"cuisine_category": "null", "cuisine_category_reason": "The diner mentions they have always enjoyed the food, indicating a preference for the cuisine offered.", "specific_dishes_or_attributes": "null", "visit_purpose": "null", "visit_purpose_reason": "The diner refers to this place as a 'regular stop,' suggesting they visit frequently for enjoyment.", "quality_criteria": "The food is enjoyed, and the service is good for the most part, indicating a generally positive experience with some minor reservations about service consistency.", "visit_context": "null", "visit_context_reason": "The diner mentions 'my husband and me,' indicating they visited together."}}
{"review_id": "vz133KDJ8G5trZ7Fs5vdKg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "PADjJf62nfYtyFCzv8rvNw", "rating": 5.0, "timestamp": "2018-04-17 00:32:07", "review_text": "One of my favorite happy hour restaurant in the city. It never disappoints, amazing food, drinks and service. I love just sitting by the bar area and ordering from their happy hour menu. The prices are right and you don't feel cheated with the portions. Here's what I ordered this time: \nCrispy Cauliflower, Drums of Heaven, Tikki Naan Pizza with chicken, and Shrimp Taco. Everything was to die for.", "extracted_aspects": {"cuisine_category": "American and Indian fusion", "cuisine_category_reason": "The review mentions specific dishes that suggest a preference for a variety of flavors and styles, including crispy cauliflower, drums of heaven, tikki naan pizza, and shrimp tacos.", "specific_dishes_or_attributes": "The crispy cauliflower and drums of heaven were described as 'to die for', indicating a strong positive sentiment.", "visit_purpose": "To enjoy happy hour.", "visit_purpose_reason": "The review indicates that the diner frequents the restaurant for happy hour, which is a specific motivation for their visit.", "quality_criteria": "The food, drinks, and service were all positively highlighted, while the prices were noted as fair, suggesting overall satisfaction with the experience.", "visit_context": "The diner visited during happy hour and sat by the bar.", "visit_context_reason": "The diner mentions enjoying the happy hour menu while sitting by the bar area, indicating a casual dining context."}}
{"review_id": "NZFkTVUpzDm6BWSiz7DsKA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "emvvPgIEOLruyz0sQZ8OYg", "rating": 4.0, "timestamp": "2018-04-26 00:48:29", "review_text": "I'm a fan of IndeBlue for fresh, delicious Indian food. The stand out appetizer for me was the scallops, which were cooked to perfection.  Chicken tikka was slightly spicy, smoky, and juicy.  The moilee, a sort of seafood curry, was delicious.  I wasn't too happy that they serve you only 3 pieces of naan per order, and I wish they offered some sort of hot sauce for the table to vary the heat level.  I'd love to see a variation on Indian rice pudding or lassi for dessert.\n\nI agree with others that the lighting is too dim.  I didn't even realize my rice was yellow until I saw the leftovers in the fridge.  There were quite a few people taking multiple photos with flash (temporarily blinding everyone in the vicinity), and I feel that the staff should be better about asking them to turn the flash off.  \n\nOverall, a good meal and we will be back.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner explicitly states they are a fan of 'fresh, delicious Indian food.'", "specific_dishes_or_attributes": "The scallops were cooked to perfection, and the chicken tikka was slightly spicy, smoky, and juicy, while the moilee was delicious.", "visit_purpose": null, "visit_purpose_reason": null, "quality_criteria": "The meal was good overall, but the diner was unhappy with the limited naan pieces and the dim lighting.", "visit_context": null, "visit_context_reason": null}}
{"review_id": "kwu8P2MIQnuJ4vY5WnXe0A", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "6rLcSCokJDCpwSjdiZty3g", "rating": 2.0, "timestamp": "2018-04-30 18:06:36", "review_text": "I was really excited to try this place but was let down. I went for happy hour and everything I tried had too subtle of an Indian taste - especially the paneer toast and tikka naan pizza. The bbq pork samosa rolls were OK but the dipping sauce was bland. The vegetable samosa chaat were the best of the bunch.\n\nIndian flavors are usually so overpowering (in a good way) but the appetizers were lacking! The atmosphere was nice so maybe I'd go back and try an entree but will skip any apps!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review specifically mentions Indian flavors and dishes like paneer toast and tikka naan pizza.", "specific_dishes_or_attributes": "The paneer toast and tikka naan pizza had too subtle of an Indian taste, while the vegetable samosa chaat were the best of the bunch.", "visit_purpose": "To enjoy happy hour.", "visit_purpose_reason": "The diner mentions they went for happy hour, indicating a social or casual dining experience.", "quality_criteria": "The appetizers had too subtle of an Indian taste, but the vegetable samosa chaat were the best of the bunch.", "visit_context": "The diner visited during happy hour.", "visit_context_reason": "The review states 'I went for happy hour,' indicating the time and purpose of the visit."}}
{"review_id": "3WX0Vswo3L5JtGFrIyUZ-Q", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "4nTTGHn5a1L6Gsa0LWFpcg", "rating": 5.0, "timestamp": "2018-05-05 23:46:37", "review_text": "IndeBlue is great quality indian food which is pretty affordable. The ambiance is slightly upscale but not full-on fine dining. I did like the decorations inside quite a bit. Great for a relaxed place to eat ethnic food that is a 'nice' sit-down place. \n\nI went here on saturday for lunch with a friend. It was 12:30 and we were immediately seated. They have both 'brunch-y' indian type food, and regular indian food. The brunch food was sort of a fusion between indian and western food. We ordered an appetizer (the spinach chaat ($9) which was excellent. It probably wasn't too healthy, but the spinach was fried very crispy and had a thin layer of crunch on it. It reminded me of those japanese thin seaweed snacks. The oiliness of the food was just right, and the touch of yogurt and tomatoes made a nice sweet-salty extra dimension to the food.\n\nThe chicken makhani ($13) was also great. The dish is kind of like pulled chicken meat which is served inside a sweet and buttery red sauce. I believe it is made out of tomatoes. It was nothing too fancy but tasted homey without being too overpoweringly fatty/salty. \n\nI was happy with my meal overall and will be coming back to try the other things on the menu.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions 'great quality indian food' and 'brunch-y indian type food', indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The spinach chaat was excellent, with a crispy texture and a nice sweet-salty extra dimension from the yogurt and tomatoes.", "visit_purpose": "Social dining", "visit_purpose_reason": "The diner visited for lunch with a friend, indicating a social dining purpose.", "quality_criteria": "The food was great overall, with excellent dishes like the spinach chaat and chicken makhani, but the spinach chaat was noted to probably not be too healthy.", "visit_context": "Lunch on Saturday at 12:30 with a friend", "visit_context_reason": "The diner went on Saturday at 12:30 for lunch with a friend and was immediately seated."}}
{"review_id": "QYl-vTlP3JvMoAuSEIHqBg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "Ygi1otJvXe_RLyIAVulsEQ", "rating": 5.0, "timestamp": "2018-05-08 03:31:26", "review_text": "Came here for brunch with friends after running Broad St. The last few miles, all I could think about was Indian fusion brunch with bottomless mimosas. The restaurant is small, but accommodated our reservation of 6. We all showed up a different times so it was a little late start but our waitress, Lori, was on top of our hungry and thirsty party! She was great to work with and genuine. She gave me a fun glance after I ordered the bottomless mimosas and saw it as a challenge to always have a full glass for me. And indeed, she won the challenge! She was great in recommending brunch items and drinks for others as well. I ordered the vindaloo skillet and was not disappointed with my selection. The food came out quickly and I was treated with great twist on vindaloo curry with sunny side up eggs, potatoes, sausage and challah. The flavor was solid. My wife enjoyed the chicken and waffles which I copped some pieces while she was not looking. Also, a big favorite for brunch goers. These two dishes were amazing. Overall, great experience! Especially with live music with the sitar and drums. Thank you so much, Lori, for a great time!", "extracted_aspects": {"cuisine_category": "Indian fusion", "cuisine_category_reason": "The diner specifically mentions 'Indian fusion brunch' as a key aspect of their meal.", "specific_dishes_or_attributes": "The diner found the vindaloo skillet to be a great twist on vindaloo curry with sunny side up eggs, potatoes, sausage, and challah, and described the flavor as solid.", "visit_purpose": "Brunch with friends", "visit_purpose_reason": "The diner explicitly states they came for brunch after running Broad St.", "quality_criteria": "The food came out quickly and the vindaloo skillet and chicken and waffles were both described as amazing.", "visit_context": "Brunch with friends after running Broad St.", "visit_context_reason": "The diner mentions they were with friends and had a reservation for 6, indicating a group visit."}}
{"review_id": "E_GT82IrKOcRxenGQi1AHg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "bq1r3VN1PpII_A7ndvY8qg", "rating": 5.0, "timestamp": "2018-05-23 17:38:05", "review_text": "IndeBlue\n\nTaste: 9/10\nReturn on Investment: 8.5/10\nPrice:7.5/10\n\n$15 lunch special. Pork vindaloo (came with rice but i substituted rice for more meat lol poutines enough carbs) and Sali Bati Poutine (lamb, spicy masala fries, cheese curds, sharp cheddar) and some Naan\n\nWow. Those poutine fries spanked my tastebuds there was so much flavor comin from every direction the lamb the cheese the spices on the fries it was just boomboomboom boom boom!\n\nThe pork vindaloo was good too i have no clue what spices or sauce goes into it but all the meat was tender and flavorful. Pretty spicy for me though I was sweaty at the end but definitely satisfied my tummy.\n\nThe naan was good it was soft and fluffy and had a bit of a bite to it which is everything I look for in a naan its addicting to eat them naans. I got a plain naan to assess their bread but i woulda gone w the waiters preference and gotten a garlic one\n\nOnly complaint is i wish naan was unlimited LOL but overall, nice !!!", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like pork vindaloo and Sali Bati Poutine, which are indicative of Indian cuisine.", "specific_dishes_or_attributes": "The poutine fries were flavorful and satisfying, while the pork vindaloo was good but too spicy for the diner.", "visit_purpose": null, "visit_purpose_reason": "The review does not explicitly state a purpose for the visit.", "quality_criteria": "The food was flavorful and satisfying, but the spice level of the pork vindaloo was too high for the diner.", "visit_context": null, "visit_context_reason": "The review does not provide specific details about who the diner was with or when they visited."}}
{"review_id": "Wg9LEdcn6G6uTNcyO4Nphg", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "EGh0HRlN8dyjrAIoEdjqpg", "rating": 2.0, "timestamp": "2018-05-25 03:39:41", "review_text": "stopped at IndeBlue last night for dinner with three friends and we honestly did not understand what the hype was about. Personally, I was super disappointed with everything I had. \n\nI started off with a indebluetini ($12) which tasted like mango lassi with alcohol. For appetizer, we had the vegetable samosa chaat which were delicious. You can never go wrong with samosas! Now for the meal, we ordered 4 orders of naan, two curries; chicken tikka masala and madras. Both lacked flavor and tasted nothing like it should. Super boring..there wasn't anything about it that wowed us. For the naan, each person had 1 full naan which did make sense if it cost $3... that's extremely pricey for plain bread. Now each dish typically comes with a side of rice. For the two curries we had, we got 1 rice to share between 4 people. I honestly don't understand logic. I personally didn't like IndeBlue, the foods overpriced and bland so for that reason I'm giving it 2 stars.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like samosas and curries, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The vegetable samosa chaat was delicious, but the chicken tikka masala and madras lacked flavor and were super boring.", "visit_purpose": "Dinner with friends", "visit_purpose_reason": "The diner visited for dinner with friends, as indicated by the phrase 'stopped at IndeBlue last night for dinner with three friends.'", "quality_criteria": "The food was overpriced and bland, with the naan being pricey for plain bread and the curries lacking flavor.", "visit_context": "With three friends last night", "visit_context_reason": "The review states that the diner was with three friends and visited last night."}}
{"review_id": "FVC9e-c6Zt7CQbXTgyQ2AQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "LC0s_RIoX0MMrCYUpnzQjA", "rating": 4.0, "timestamp": "2018-06-04 19:07:07", "review_text": "Indian cuisine is probably my favorite ethnic cuisine. I am very critical of Indian food as it can be difficult to prepare. IndeBlue knocks it out of the park. I would say there is an American twist on their Indian food, but the authentic flavor profiles are always there. I have been once for restaurant week, and once my birthday. Restaurant week service was slow, but I guess that is expected.\n\nEvery single thing I've eaten here has been so good. The cocktails are unique and eclectic. The indebluetini is delicious. The bloody mary is also really good. My only gripe is the service. My birthday was the kicker. There were about 14 people for brunch. They literally made us get up as a reservation was coming in. We were not there for an extended period of time. We were rushed after an hour into the meal, and we were not even onto dessert at this point. It was very rude, and the server had a bit of a tude. Despite the service, the food is what keeps me coming back.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The diner explicitly states that Indian cuisine is probably their favorite ethnic cuisine.", "specific_dishes_or_attributes": "The indebluetini is delicious, and the bloody mary is also really good.", "visit_purpose": "Celebration", "visit_purpose_reason": "The diner mentions they have been to the restaurant for restaurant week and for their birthday.", "quality_criteria": "The food is consistently good, but the service is slow and rude.", "visit_context": "The diner visited with a group of 14 people for brunch on their birthday.", "visit_context_reason": "The diner indicates they visited for restaurant week and their birthday, and mentions the presence of 14 people for brunch."}}
{"review_id": "z0JPXqua5f6s5XJptm70BQ", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "PaRgkpXefjqsJPBb5StThA", "rating": 5.0, "timestamp": "2018-06-08 19:39:16", "review_text": "We were in Philadelphia for a week and by far this was the best meal we had. And that's saying a lot considering the fantastic variety of food available in this town. \n\nThe atmosphere is wonderful. Quiet, well spaced tables and nicely appointed.\n\nOur server, Josh, was attentive and knowledgeable of the menu. Answered all our questions and provided great service. \n\nThe food was amazing. We had the tasting menu which was a huge amount of food but we managed to eat most of it! The crispy spinach chatt was wonderful and the most surprising selection. The vindaloo and moilee were excellent and the lamb lollipops cooked perfectly. The Naan is soft with just enough crispness. \nCannot recommend IndeBlue enough.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like 'vindaloo', 'moilee', and 'Naan', which are indicative of Indian cuisine.", "specific_dishes_or_attributes": "The crispy spinach chatt was wonderful and the lamb lollipops cooked perfectly.", "visit_purpose": "To have a memorable meal during their stay in Philadelphia.", "visit_purpose_reason": "The review indicates that this was the best meal during their week in Philadelphia, suggesting a desire for a memorable dining experience.", "quality_criteria": "The atmosphere was wonderful and the service was attentive, but the review does not mention any negative aspects.", "visit_context": "The diner was in Philadelphia for a week.", "visit_context_reason": "The review states they were in Philadelphia for a week, indicating the timing and location of the visit."}}
{"review_id": "KE-Qlk35Tf09xWt5prl8mA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "8q5yP1VWPwGZwKagTf1vzQ", "rating": 5.0, "timestamp": "2018-06-15 13:38:58", "review_text": "Myself and 3 friends stopped in for an impromptu Sunday brunch after our plans elsewhere fell through. Their tables were all booked but we managed to find 4 seats at the bar and we were so glad we did. The food was great! Two of my friends had the spicy chicken and waffles which has an amazing presentation. It's definitely a crowd favorite. I tried the create-your-own-omelette. The cheese they used was soooooo good. It completely made the omelette. This is one of the few places in Philly that has bottomless mimosas also ($22). All of the employees were very friendly as well. This would be a great spot for a boozy brunch with friends.", "extracted_aspects": {"cuisine_category": "Brunch", "cuisine_category_reason": "The review mentions specific dishes like 'spicy chicken and waffles' and 'create-your-own-omelette', indicating a preference for brunch-style foods.", "specific_dishes_or_attributes": "The spicy chicken and waffles had an amazing presentation and is definitely a crowd favorite, while the cheese in the create-your-own-omelette was soooooo good and completely made the omelette.", "visit_purpose": "Impromptu brunch", "visit_purpose_reason": "The diner and their friends were looking for a place to eat after their original plans fell through.", "quality_criteria": "The food was great with the spicy chicken and waffles being a crowd favorite, but there is no negative judgment mentioned.", "visit_context": "The diner visited with three friends on a Sunday.", "visit_context_reason": "The diner visited with three friends on a Sunday and found seats at the bar after their plans fell through."}}
{"review_id": "jfaq5JBtk3wJON0rgmhRbw", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "YMkdlZLq9mJU1OpYhVPj2w", "rating": 4.0, "timestamp": "2018-06-23 06:56:18", "review_text": "Came here for a friend's 21st birthday party! The food is amazing! It's not cheap (hopefully you didn't expect it to be) but great! And it's enough to fill you up (priorities). Their cocktails are... interesting. We ordered a couple and they were hit or miss -- wouldn't recommend the cocktail with chili in it. We thought we were experimenting but were actually just making a huge mistake hahaha. But don't worry! There are other good drinks. The waiting staff -- so nice! And sociable! The only thing that really irritates me was that we asked if we could hold a cake in the refrigerator while we ate and they charged us TWENTY FIVE DOLLARS for storage and cutting! We could have totally done that ourselves! And even if they did it, there's no reason to charge $2.50 per person for something that simple. That's robbery! But overall it's a good choice -- just be ready to spend and don't bring that cake!!!", "extracted_aspects": {"cuisine_category": "American", "cuisine_category_reason": "The diner describes the food as 'amazing' and mentions that it is 'not cheap' but 'great'.", "specific_dishes_or_attributes": "The cocktails are described as 'interesting' with a negative sentiment towards the cocktail with chili, which was considered a 'huge mistake'.", "visit_purpose": "Celebration", "visit_purpose_reason": "The diner came for a friend's 21st birthday party.", "quality_criteria": "The food is amazing and filling, but the charge for cake storage is considered excessive and unfair.", "visit_context": "The diner attended a friend's 21st birthday party.", "visit_context_reason": "The visit was for a friend's birthday party, indicating a social gathering."}}
{"review_id": "kT5ThcKHaCLFMMUiwlY7_A", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "f3ZBI7v6aLOCecagnx3uMQ", "rating": 5.0, "timestamp": "2018-06-24 02:52:31", "review_text": "My family and I came for my birthday brunch to Indeblue. I love the decor of this place, and although it was slightly on a dimmer side considering it was for brunch it kind of added to the ambiance. \nFirst of all, the service was truly good (efficient, professional, and friendly). The place was clean and didn't feel uncomfortable sitting. We did not feel rushed, but well taken care of. \nWe ordered veg thali, build your own omelet, vindaloo egg skillet, extra order of Desi home fries, rose mimosa, and spicy chicken 'n' waffle. I can say everything, I mean, everything was delicious! If I can complain about one thing maybe the fried chicken was a bit over done and became dry, but the flavour was good. Some of the dishes in my veg thali reminded me of the flavours my Indian friends' moms cooked for me when I visited them. I will come back again for lunch and dinner next time to try out their other dishes. We were so satisfied we all left happy! \nSince this is in the midtown section of center city if you are driving you may want to park further away and walk (if you don't want to pay for the garage), and if you are lucky you will find street parking, but be sure to have quarters because some of the street parkings still have metered parking.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific Indian dishes like veg thali and vindaloo egg skillet, indicating a preference for Indian cuisine.", "specific_dishes_or_attributes": "The fried chicken was a bit overdone and became dry, but the flavour was good.", "visit_purpose": "Birthday brunch", "visit_purpose_reason": "The review states it was for the diner's birthday brunch, indicating a celebratory purpose.", "quality_criteria": "The service was truly good (efficient, professional, and friendly), and everything was delicious, but the fried chicken was a bit overdone and became dry.", "visit_context": "Visited with family for birthday brunch", "visit_context_reason": "The review indicates that the diner visited with family for a birthday brunch."}}
{"review_id": "il4wrY_MqFarhvHZJJV9VA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "-tz9i4wSQg4vSQzAA5Svqg", "rating": 5.0, "timestamp": "2018-06-25 04:14:01", "review_text": "I love everything about this place. They have one of the best brunches in Philadelphia. I come here for happy hour all the time just for the spinach chaat and paneer pizza. The drinks are different and amazing. I would highly recommend this place to anyone.", "extracted_aspects": {"cuisine_category": "Indian", "cuisine_category_reason": "The review mentions specific dishes like 'spinach chaat' and 'paneer pizza', which are indicative of Indian cuisine.", "specific_dishes_or_attributes": "The diner loves the 'spinach chaat' and 'paneer pizza', indicating a positive sentiment towards these dishes.", "visit_purpose": "To enjoy happy hour.", "visit_purpose_reason": "The diner states they come for 'happy hour all the time', indicating a regular visit for enjoyment.", "quality_criteria": "The diner finds the drinks to be 'different and amazing', while also praising the brunch as one of the best in Philadelphia.", "visit_context": null, "visit_context_reason": "The review does not specify who the diner visited with or when exactly they visited, only mentioning a general habit of going for happy hour."}}
{"review_id": "9DHjjtsiAjK7F3sJgarXyA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "1msVg_B-Ef6K814sQDOTPA", "rating": 5.0, "timestamp": "2018-06-26 14:33:26", "review_text": "INDEBLUE - this has been on my restaurant list forever and I can't believe I've waited so long to try it! I came here for a Sunday birthday brunch and was blown away at how reasonable the menu was. Large dishes with many different parts for $9-12??? Unbelievable. The waitress seemed to try to sell a lot of things to us (especially the chai and the $16 chef's tasting) but I think she was just being friendly... and the chai really was unbelievable. Ended up spending a little more than I wanted but that's because I took home an additional chicken tikka masala wrap after eating one for brunch myself haha. I wanted to bring home a different dish but to be honest, that's the least messy and would taste the best reheated. I tried the chicken and waffles which had a nice South Asian twist, but personally not my favorite (though it seems to be a Yelp favorite for sure!) The fries that came with my chicken tikka masala wrap were heavenly and the highlight of my meal when it was fresh. Great ambience and interior design for taking pictures. In the heart of Center City, definitely go if you haven't been yet.", "extracted_aspects": {"cuisine_category": "South Asian", "cuisine_category_reason": "The review mentions a South Asian twist in the chicken and waffles and highlights the chicken tikka masala wrap, indicating a preference for South Asian cuisine.", "specific_dishes_or_attributes": "The chicken tikka masala wrap was described as heavenly and the highlight of the meal when fresh, while the chicken and waffles were noted as not the diner's favorite despite being popular.", "visit_purpose": "Birthday brunch", "visit_purpose_reason": "The diner explicitly states they came for a birthday brunch, indicating a celebratory purpose.", "quality_criteria": "The menu was praised for being reasonable with large dishes, but the chicken and waffles were not the diner's favorite, indicating mixed feelings about the dishes.", "visit_context": "Sunday birthday brunch", "visit_context_reason": "The review mentions it was a Sunday birthday brunch, providing clear context about the timing and occasion."}}
{"review_id": "sxiyBmCVJ_-PaZn2SAhBWA", "item_id": "-0TffRSXXIlBYVbb5AwfTg", "user_id": "Gys4J9fwKIrc2Xl2snOrEA", "rating": 3.0, "timestamp": "2018-07-01 23:24:36", "review_text": "This review is for brunch. The service was nice and efficient. We arrived at 12 on a Saturday and the place was not crowded at all. \n\nWe didn't order any of the Indian dishes, instead we got traditional brunch food. I got the mango French toast and my friend got spicy chicken and waffles. They both had an Indian twist to them. The chicken is boneless and covered in some spicy sauce. The French toast had some sort of Creme and chunks of mango. \n\nWe also got bottomless drinks for $22 per person. The options were mimosa or rose (not rosé) mimosa. The drinks were pretty lackluster. I barely got buzzed and I had 6 of them. It tasted mostly like sugar or syrup. I would not recommend this option. \n\nI will say I had a weird encounter with the manager. He came to our table to make a joke that we got waffles at an Indian restaurant. I get where he was going, but the irony was that he was a white man who is the manager of an Indian restaurant with an all Indian and black staff so, I mean, that joke kinda fell flat. He also made it to two other tables within earshot, so it may happen to you!\n\nAll in all, I'll come back because I want to try the Indian dishes as they do look quite good based on the ones I saw other people ordering.", "extracted_aspects": {"cuisine_category": "Brunch, Indian", "cuisine_category_reason": "The diner chose traditional brunch food with an Indian twist, indicating a preference for both brunch and Indian cuisine.", "specific_dishes_or_attributes": "The mango French toast had chunks of mango and some sort of creme, which the diner found appealing, while the bottomless drinks were described as lackluster and mostly tasting like sugar or syrup.", "visit_purpose": "Brunch", "visit_purpose_reason": "The diner visited for brunch on a Saturday, which is a common time for brunch outings.", "quality_criteria": "The service was nice and efficient, but the bottomless drinks were disappointing and not worth recommending.", "visit_context": "The diner visited with a friend at 12 on a Saturday.", "visit_context_reason": "The diner arrived at 12 on a Saturday with a friend, and the restaurant was not crowded."}}
