{"item_id": "B08SQ61QKJ", "item_title": "The Evil of Two Lessers (A Tanner Novel Book 41)", "item_description": "From REMINGTON KANE, the author of the TAKEN! SeriesTHE EVIL OF TWO LESSERS - A Tanner Novel - Book 41 Tanner is under assault by several enemies at once.", "item_summary": "Tanner faces simultaneous threats from multiple adversaries in this thriller, the 41st installment in the Tanner series. The novel delves into themes of survival and resilience against overwhelming odds."}
{"item_id": "1476729093", "item_title": "The Rosie Project: A Novel", "item_description": "The international bestselling romantic comedy “bursting with warmth, emotional depth, and…humor,” ( Entertainment Weekly ) featuring the oddly charming, socially challenged genetics professor, Don, as he seeks true love. The art of love is never a science", "item_summary": "The Rosie Project follows Don, a socially awkward genetics professor, as he embarks on a quest to find true love through a scientific approach. This romantic comedy explores the complexities of relationships and the unpredictability of love."}
{"item_id": "B07BN5BJ4W", "item_title": "Wildfell: A page-turning contemporary novel of gothic suspense.", "item_description": "Running away isn’t always an escape… After a traumatic experience with her graduate school professor, Anne Fleming disposes of all her possessions, boards a plane, and plans to check out of life. A chance meeting on an international flight leads her to Wildfell, a gothic mansion north of London. At first glance, Wildfell seems like the perfect place to hide out, and Anne is intrigued by its strange atmosphere and history of disappearances and deaths. Soon, echoing voices, ghostly mists, a mute girl with a sketchbook full of murders, and a possessive landlady force her to confront her deepest fears. Anne’s budding romance with gorgeous Irish actor Bain Tierney holds her to the house. But when Wildfell tenants begin disappearing and dying, Anne must decide if she trusts Bain. Is anyone in the house who they claim to be? Or are supernatural forces at work inside Wildfell? And will they ever let her leave?", "item_summary": "After a traumatic experience, Anne Fleming seeks refuge in Wildfell, a gothic mansion with a mysterious past. As strange occurrences and disappearances unfold, Anne must navigate her growing romance with an actor and determine if the threats she faces are human or supernatural."}
{"item_id": "B0B3V27TMQ", "item_title": "Stay In Tonight 2", "item_description": "Jax and Winter pursue the mysterious bodysnatcher while dealing with their increasingly complicated relationship.", "item_summary": "In \"Stay In Tonight 2,\" Jax and Winter investigate a mysterious bodysnatcher while navigating their own complex relationship. The story blends elements of mystery and romance, exploring themes of intrigue and personal connections."}
{"item_id": "1506465692", "item_title": "Bear's Bicycle (Woodland Friends, 2)", "item_description": "The Woodland Friends from Porcurpine's Pie return in this cheerful story about persevering in the face of tough challenges. Bear, Porcupine, Doe, and Squirrel all eagerly prepare for the festival on wheels. But even after studying every book on bikes he can find, Bear still struggles to get the hang of riding. While he is on his way to the library for a new book, his friends teach Bear that everyone learns in different ways, and by practicing together, they will all master riding their bikes. In this follow-up book to Porcupine's Pie , the woodland friends inspire each other in a tale of practice, perseverance, and friendship. A final spread features tips from one of Bear's books: bike safety, caring for your bike, and fun ways to decorate it!", "item_summary": "Bear's Bicycle follows Bear and his woodland friends as they prepare for a festival on wheels, learning to ride bicycles through practice and mutual support. The story emphasizes perseverance, friendship, and the idea that everyone learns at their own pace."}
{"item_id": "1098355466", "item_title": "twenty:six", "item_description": "twenty:six is a collection of poetry that Kendyl Rose has broken up through different chapters of emotions. A journey through time, it explores an array of different periods of life relatable to all readers. Raw, emotional, and real, twenty:six is able to put feelings into words effortlessly.", "item_summary": "Twenty:six is a collection of poetry by Kendyl Rose that explores various life stages and emotions, structured into chapters that capture raw and relatable feelings. The work offers a journey through time, presenting an honest and accessible exploration of human experiences."}
{"item_id": "074404278X", "item_title": "How To Train Your Pokémon: A guide to keeping your Pokémon happy and healthy", "item_description": "You've caught your very first Pokémon! What do you do now? Should you groom your Pokémon? What does your Pokémon like to eat?Does your Pokémon need exercise?How many Pokémon should you have? Pokémon need to be looked after and nurtured. From where to find a Snorlax to the treats that your Pikachu will love, learn the secrets to caring for and training your Pokémon with this handy guide. How To Train Your Pokémon is the perfect gift for any budding Pokémon Trainer.  © 2021 The Pokémon Company International. © 1995 – 2021 Nintendo/Creatures Inc. / GAME FREAK inc. TM, ®, and character names are trademarks of Nintendo.", "item_summary": "How To Train Your Pokémon is a guidebook for young readers on how to care for and train their Pokémon. It covers essential topics such as grooming, feeding, exercise, and the ideal number of Pokémon to have, offering tips and secrets to keep Pokémon happy and healthy."}
{"item_id": "B0BN21JFR7", "item_title": "Little", "item_description": "\"Little\" is a celebration of living in the moment with the special child (or children) in your life.Packed with whimsical illustrations, fun rhymes, and a handprint art activity section; we hope that you and yours experience great joy on this \"Little\" adventure! We hope your little one will want to talk, learn, laugh, count, and create when you share the pages of this dreamy book together!After all, it's the \"Little\" things in life that matter most.", "item_summary": "Little is a children's book that celebrates the joy of shared moments with young ones, featuring whimsical illustrations, playful rhymes, and interactive handprint art activities. It encourages children to engage in learning, creativity, and laughter, emphasizing the importance of cherishing small, meaningful experiences."}
{"item_id": "B099P5ZYDZ", "item_title": "Mine", "item_description": "What happens in Vegas just might kill you. In Vegas on his birthday weekend, Justin Gray discovers he's married to a beautiful stranger. A drunken mistake, he insists on an annulment and assumes his life will return to normal once he gets back home. He assumes wrong. As the young woman refuses to give him an annulment and insists the marriage continue, their wild weekend turns into a deadly mistake. Murder is only the beginning. Get ready for a tale of greed so twisted you won’t know what’s on the next page or who anyone really is until the… very…last…page.", "item_summary": "Justin Gray finds himself in a dangerous situation after a drunken marriage in Vegas turns deadly when his new wife refuses an annulment. The story unfolds into a suspenseful thriller filled with murder and deception, driven by a twisted tale of greed."}
{"item_id": "B08VNFWRQT", "item_title": "The Executioner's Rebellion (The Executioner's Song Book 4)", "item_description": "Executioners bring order to chaos, but will Justice be enough to stop what’s coming? As executioner within Verendal, Finn takes on more responsibility, especially now that he’s saved the kingdom from repeated attack, but he still struggles with his place within the city. When protests erupt within Verendal, with those from the poorer sections clashing with Archers, Finn finds himself investigating a very different kind of crime than he’s ever pursued. Worse, it’s one that might involve witchcraft he doesn’t understand, and this time his usual tactics won’t be enough. Asked to be more than the Hunter, he doesn't know what that means for him. Finn must find those responsible before the city falls into chaos, but it might be too late to keep the violence from spreading throughout the kingdom.", "item_summary": "The Executioner's Rebellion follows Finn, an executioner in Verendal, as he navigates increasing responsibilities and social unrest within the city. When protests escalate into violence and potential witchcraft, Finn must confront crimes beyond his usual expertise to prevent the kingdom from descending into chaos."}
{"item_id": "B09LGWLC6J", "item_title": "Hellfire Heist (Demon Wolf Hunter)", "item_description": "Book two of the Demon Wolf Hunter Series. Hellfire Pack is a steamy, enemies to lovers paranormal romance. If you want an action-packed read with twists and turns, download your copy today.", "item_summary": "Hellfire Heist is the second book in the Demon Wolf Hunter series, a steamy paranormal romance featuring an enemies-to-lovers plot. The story is action-packed with twists and turns, blending elements of fantasy and romance."}
{"item_id": "B09K1WT8QW", "item_title": "Elves in The Kitchen: An MKSP Coloring Book for Kids 2-5 | Mystical Holiday Creatures | Screen Free Activities", "item_description": "Elves in the Kitchen is an MKSP coloring book full of fun and holiday mischief for kids 2 - 7.There are no double-sided pages, so any medium can be used; crayons, paint, felt-tip markers.", "item_summary": "Elves in the Kitchen is a coloring book designed for young children aged 2 to 7, featuring holiday-themed illustrations of mystical creatures. The book encourages screen-free activities and allows children to use various art mediums on its single-sided pages."}
{"item_id": "B0BXNK5D1F", "item_title": "Logic Puzzles: 50 Logic Grid Puzzles - Fun, Easy to Hard - Large Logic Puzzles Activity Book for Adults (Brain Teasers with Solutions)", "item_description": "Are you looking for fun logic puzzles that can entertain the brain? Well look no further, this book contains 50 logic grid puzzles that have hours of packed fun! This book contains 50 logic grid puzzles for adults that start with 3x3 to 4x7 grids. Each problem has been tested and has solutions at the end if you get stuck. In this book you will find: How to Play How to Play 50 Solvable Puzzles 50 Solvable Puzzles Easy to Hard Difficulty Easy to Hard Difficulty Solutions Solutions Book Size: 8.5 x 11 in / 21.6 x 28 cm Book Size: 8.5 x 11 in / 21.6 x 28 cm What makes our puzzles stand out? EASY TO READ - Magnifying glass is not necessary. We have a large, readable print with plenty of room to write that makes for hassle-free puzzle-solving. ENGAGING, UNIQUE PUZZLES - Be gone of repetitive, boring puzzles. We pride ourselves on our 50 new and interesting logic grid puzzles that put the fun in logic. HIGH-QUALITY FUN - No puzzling mistakes. We make sure our problems and solutions are of great quality for our great-quality customers. VARYING DIFFICULTY - Our variety of easy-to-hard puzzles gives you a taste of everything, making it so you can be either relaxing in bed, or hands-on head focused. BRAIN TEASERS FOR ADULTS - Our skill level is for adults and up – so if you meet the mark and can handle the fun, give these logic grid puzzles a go!", "item_summary": "Logic Puzzles is a collection of 50 logic grid puzzles designed for adults, ranging from easy to hard difficulty levels. The book includes instructions on how to play, a variety of puzzles, and solutions for each problem, catering to those seeking mental stimulation and entertainment."}
{"item_id": "B09T8WRZH6", "item_title": "Claimed by Daddy's 4 Dirty Friends: An Age Gap Contemporary Reverse Harem (Their Temptation)", "item_description": "Four handsome Executives + One fortunate ivy league college grad = One angry dad But, I’m an adult and it’s too late I’m in love. With all of them. Maybe we can make this work.", "item_summary": "Claimed by Daddy's 4 Dirty Friends follows an Ivy League graduate who finds herself in a complex romantic situation with four handsome executives, leading to tension with her father. The story explores the challenges and possibilities of navigating a relationship with multiple partners in a contemporary reverse harem setting."}
{"item_id": "1643751832", "item_title": "Our Shadows Have Claws: 15 Latin American Monster Stories", "item_description": "Fifteen original short stories from YA superstars, featuring Latine mythology’s most memorable monsters From zombies to cannibals to death incarnate, this cross-genre anthology offers something for every monster lover. In Our Shadows Have Claws , bloodthirsty vampires are hunted by a quick-witted slayer; children are stolen from their beds by “el viejo de la bolsa” while a military dictatorship steals their parents; and anyone you love, absolutely anyone , might be a shapeshifter waiting to hunt.   The worlds of these stories are dark but also magical ones, where a ghost-witch can make your cheating boyfriend pay, bullies are brought to their knees by vicious wolf-gods, a jar of fireflies can protect you from the reality-warping magic of a bruja—and maybe you’ll even live long enough to tell the tale. Set across Latin America and its diaspora, this collection offers bold, imaginative stories of oppression, grief, sisterhood, first love, and empowerment.   Full contributor list: Chantel Acevedo, Courtney Alameda, Julia Alvarez, Ann Dávila Cardinal, M. García Peña, Racquel Marie, Gabriela Martins, Yamile Saied Méndez, Maika Moulite and Maritza Moulite, Claribel A. Ortega, Amparo Ortiz, Lilliam Rivera, Jenny Torres Sanchez, Ari Tison, and Alexandra Villasante.", "item_summary": "Our Shadows Have Claws is an anthology of fifteen original short stories by YA authors, featuring Latin American mythology's most iconic monsters. The collection explores themes of oppression, grief, sisterhood, and empowerment through dark and magical tales set across Latin America and its diaspora, offering a variety of monsters and cross-genre narratives."}
{"item_id": "B0915PKWDX", "item_title": "SAT & ACT \"Hard\" Math Problems: Reaching For Perfection (College Entrance Exam Prep Books)", "item_description": "Get ready to be challenged! The 200 \"hard\" SAT and ACT math problems in this book are modeled after the hardest problems ever seen on the SAT and ACT. They were also chosen based on my many years tutoring hundreds of students for the SAT and ACT exams, so I know which ones they struggle with the most. Since students have a broad range of math skill levels and abilities, some problems will be more challenging than others depending on the particular student using this guide. But, there will surely be something for everyone in terms of difficulty and concepts not fully understood. The solutions offered are my own, and are designed to answer the questions as efficiently as possible while minimizing confusion. If you're aiming to get into a top tier college, then this book will surely help you get there.", "item_summary": "SAT & ACT \"Hard\" Math Problems: Reaching For Perfection is a test preparation guide featuring 200 challenging math problems designed to mimic the most difficult questions from the SAT and ACT exams. The book aims to help students improve their math skills and prepare for top-tier college admissions by providing efficient solutions to complex problems."}
{"item_id": "B00HWSSHJ4", "item_title": "Executable (The Demon Accords Book 6)", "item_description": "Amazon bestselling author John Conroe takes his beloved Demon Accords series in an exciting new direction with Book 6. For seventeen years Declan O'Carroll has lived quietly in the upstate Vermont town of Castlebury, waiting impatiently for a chance to get out and meet the great wide world. When an odd new girl appears in town, Declan finds out that the world might be coming to meet him. But the big question remains... who is in more danger? Declan or the world?", "item_summary": "Executable is the sixth installment in the Demon Accords series by John Conroe, focusing on Declan O'Carroll, who has lived quietly in Castlebury, Vermont. When a mysterious girl arrives, Declan's life takes a dramatic turn, raising questions about who is in greater peril, him or the world."}
{"item_id": "B0B61VKCFL", "item_title": "Tops: Dark Arsenal Duet Book 1", "item_description": "The city's noise followed me years after I left that godless place. But being in an area without God meant there was just enough pleasure in the chaos to make you forget how terrible it was. Or at least how terrible I should have thought it was.The sounds of the city and all the people in it drowned out my own voice of self-preservation. Up became down. Left became right. Tops became Bottoms. It took me a while to truly understand what that meant. My time with them made me question who I was and who I simply thought I was supposed to be.A group of unforgettable men turned my world upside down by pinning me like a butterfly to a board. It's funny how in life, sometimes the thing you need the most is the one thing that can shatter you from the inside.Note* This book is intended for audiences 18+ as it includes explicit sexual content as well as dark themes that some readers may find triggering. Please look over the full Content Warnings before purchasing.", "item_summary": "Tops: Dark Arsenal Duet Book 1 follows a protagonist who, after leaving a chaotic city, reflects on how a group of men disrupted their life and identity. The narrative explores themes of self-discovery and the consequences of intense experiences, set against a backdrop of explicit content and dark themes."}
{"item_id": "0760369119", "item_title": "Farty Pants: A Sound Book of Stink - 10 Fart Sounds!", "item_description": "He farts! She farts! We all fart—but why ? Combining real science with humor, Farty Pants explains it all—complete with full-color illustrations and hidden buttons that trigger ten unique fart sounds. Each sound relates to a humorous fact on the same page. Were farts always taboo? Did kings and queens fart? Is there a difference between baby and grandpa farts? Learn all of this and more with facts that cover their loudness and speed, as well as how farts work differently in water, space, and beyond!", "item_summary": "Farty Pants is a humorous and educational children's book that explores the science behind flatulence. Through full-color illustrations and interactive fart sounds, it answers questions about the nature of farts, their history, and how they differ in various contexts, all while maintaining a lighthearted tone."}
{"item_id": "B081B8SCYY", "item_title": "The Child (The Children And The Gods Book 1)", "item_description": "Newly Edited!Sarah is scared. Not just scared. Sarah is terrified! Her young daughter Emma hasn't been herself, lately. She's been showing up covered in blood and suddenly has a voracious appetite. Can Sarah, with the help of her quirky sister Jess, figure out how to save poor little adorable Emma before it's too late?", "item_summary": "The Child is a horror novel about Sarah, a mother whose young daughter, Emma, exhibits strange and frightening behavior, including appearing covered in blood and having an insatiable appetite. Sarah, with the assistance of her eccentric sister Jess, races against time to uncover the truth and save Emma."}
{"item_id": "B0B11NVWBD", "item_title": "Junior Scientists Nature 4 Book Box Set: Books About Ants, Butterflies, Fish, and Insects for Kids Ages 6-9", "item_description": "Spark curiosity about nature in kids ages 6 to 9 Encourage young learners to set out on a fact-filled adventure full of new discoveries! This collection of science books for kids teaches them about ants, butterflies, fish, and insects with tons of full-color photos and fascinating facts that make learning fun.This 4-book box set includes: Ants for Kids—Crawl inside the hidden world of ants and learn about the different types, their unique characteristics, what they eat, and much more. Ants for Kids —Crawl inside the hidden world of ants and learn about the different types, their unique characteristics, what they eat, and much more. Butterflies for Kids—Explore the butterfly life cycle and discover 32 species commonly found in North America—with tips for attracting them to your backyard! Butterflies for Kids —Explore the butterfly life cycle and discover 32 species commonly found in North America—with tips for attracting them to your backyard! Fish for Kids—Take a dive with 35 different species of freshwater and saltwater fish, from goldfish to great white sharks. Fish for Kids —Take a dive with 35 different species of freshwater and saltwater fish, from goldfish to great white sharks. Insects for Kids—Discover why certain insects buzz, which prehistoric bug was the size of a large bird, and other fun facts about flying insects. Insects for Kids —Discover why certain insects buzz, which prehistoric bug was the size of a large bird, and other fun facts about flying insects. Get this box set today and inspire your budding scientist to explore the world around them.", "item_summary": "This educational box set introduces young readers aged 6 to 9 to the natural world through four individual books focused on ants, butterflies, fish, and insects. Each book combines full-color photographs with engaging facts to explore various species, their habits, and unique characteristics, encouraging curiosity and learning about nature."}
{"item_id": "0578717298", "item_title": "Hydrants", "item_description": "Hydrants is a collection of short stories that connects anxiety ridden bodies to sexuality and relationships through personification of everyday ideas. This collection is experimental in the way of it's hybrid nature of prose and poetry.", "item_summary": "Hydrants is a collection of experimental short stories that explore the intersections of anxiety, sexuality, and relationships through the personification of everyday concepts, blending elements of prose and poetry. The narratives delve into the emotional and physical experiences of characters, offering a unique and introspective look at human connections."}
{"item_id": "1523507446", "item_title": "Mega-Maze Adventure! (Maze Activity Book for Kids Ages 7+): A Journey Through the World's Longest Maze in a Book", "item_description": "The world's longest maze in a book! A-MAZE-ING. Not just a maze––the book itself is a maze! A portal opens on the front cover, and the maze continues through every page, making this the world's longest maze in a book. Every spread is a journey through an imaginative world: there's Robot World and Butterfly World, Ski World and Underwater World, Dragon World and Skyscraper World. Filled with hypnotic details, hidden surprises, fun facts, and bright, swirling, richly-colored details, every page is a compelling adventure.", "item_summary": "Mega-Maze Adventure! is an interactive activity book featuring the world's longest maze, which spans the entire book. Each page presents a unique, imaginative world to navigate, such as Robot World, Underwater World, and Dragon World, filled with hidden surprises, fun facts, and vibrant details."}
{"item_id": "0358008417", "item_title": "Beauty Woke", "item_description": "Beauty Woke is a powerful story of pride and community, told with bold lyricism and the heart of a fairy tale, and readers looking for a next-generation Sleeping Beauty will fall in love with the vivid art and lyrical text. Beauty is a Puerto Rican girl loved and admired by her family and community. At first, she's awake to their beauty, and her own—a proud Boricua of Taíno and African descent. But as she grows older, she sees how people who look like her are treated badly, and she forgets what makes her special. So her community bands together to help remind her of her beautiful heritage!", "item_summary": "Beauty Woke is a modern retelling of Sleeping Beauty, focusing on a Puerto Rican girl named Beauty who learns to embrace her heritage and identity. The story explores themes of pride, community, and self-discovery as Beauty's community helps her remember her unique beauty and cultural roots."}
{"item_id": "B00MPLCLU4", "item_title": "Broken Promise: A Beyond Death Mafia Romance (Beyond Series Book 1)", "item_description": "For fans of \"The Ghost Whisperer,\" this series is for YOU! Previously published as \"Silent Whisper.\" What does a mob capo want with a girl from the sticks? Everything . . . For twenty-seven years, I've flitted through life clueless to the God-given abilities that lay dormant inside of me. In the blink of an eye, everything changed more than I ever could've anticipated. She changed it.Now I know that nothing is as it seems. I will never be the same again...but this isn't my story. It's hers. I'm just being forced to live it, resolve it, and ultimately try to move on after learning that our lives are going to be tangled far more than I would've ever imagined. My name is Parrish Locke. And I can see the dead. ADULT CONTENT", "item_summary": "Parrish Locke, a young woman who can see the dead, finds her life intertwined with a mob capo after discovering her latent abilities. The story explores her journey as she navigates this dangerous connection and the supernatural elements that surround her. This is a mafia romance with paranormal themes."}
{"item_id": "B09CTX916P", "item_title": "Calendar Sonettos:: December through March", "item_description": "Calendar Sonettos December-March contains the first four books of the sonnet series. The sonnet sequence concerns itself with the passage of time via verse written over a length of time. Like all sonnet cycles throughout history, each of the sonnets are a single poetic work in itself and a thread in the collection.Instagram: kitludlow", "item_summary": "Calendar Sonettos December-March is a collection of sonnets that explore the passage of time, with each poem standing alone while also contributing to an overarching narrative. This poetry series, comprising the first four books, delves into themes of temporality and continuity through a structured sequence of verses."}
{"item_id": "0593403703", "item_title": "Super Pizza & Kid Kale", "item_description": "With great flavor, comes great responsibility. Super Pizza and Kid Kale have been delicious do-gooders and the best of friends since the day they came aleaf in the oven of the Baker Elementary cafeteria. But as they heroically foil one dastardly deed after another, Super Pizza’s popularity begins to go to their crust, and it leaves their veggie pal feeling rotten. The growing frustration that begins to drive a wedge in their friendship is now threatening to take the students of the school down with them! It'll be up to Super Pizza and Kid Kale to patch things up so that they can get back to being the heroes that these kids knead. For fans of Lady Pancake and Sir French Toast comes a hilarious and punny new picture book about navigating the ups and downs of friendship and the unintendend consequences that actions can have on others, starring the Batman and Robin of food.", "item_summary": "Super Pizza & Kid Kale is a humorous children's picture book about two food-themed heroes who face friendship challenges due to Super Pizza's growing popularity. The story explores the unintended consequences of actions on others and the importance of resolving conflicts to continue being heroes to the students of Baker Elementary."}
{"item_id": "B0B21ZX3D5", "item_title": "Untrue Accusations : A Midlife Psychic Medium Series Novel", "item_description": "What does a psychic medium do when her best friend’s daughter has been accused of murder? Enlists the help of her own dead mother to find the true killer. Of course, even if Angela didn’t ask for Fran’s help, Fran would give it anyway. In my extended family, when a call comes in the middle of the night, it means someone’s died, and I usually already know the dead one stopped by for a visit.But the night it rings without a ghost checking in, I know trouble lies ahead. And boy, does it. My best friend Mel’s daughter, Sarah, is in jail, accused of her best friend’s murder. And she wants me to bail her out—without telling her mother. Uh, nope. That kind of secret can’t be kept, and honestly, that would be impossible for me. Now we’re in hot pursuit of the real killer, with help from a surprising spirit, we’re stepping one law enforcement toes and breaking laws to find them. And we will because Sarah is family, and that’s what you do for family. Even if it means one of us doesn’t survive.", "item_summary": "In \"Untrue Accusations\", a psychic medium named Angela enlists the help of her deceased mother to clear her best friend's daughter, Sarah, who is accused of murder. Together, they navigate legal boundaries and seek assistance from unexpected supernatural sources to find the true killer, driven by their familial bond."}
{"item_id": "0394800184", "item_title": "Are You My Mother ?", "item_description": "The must-have, heartwarming and hilarious classic about a baby bird in search of his mother! A baby bird goes in search of his mother in this hilarious Beginner Book edited by Dr. Seuss. When a mother bird's egg starts to jump, she hurries off to make sure she has something for her little one to eat. But as soon as she's gone, out pops the baby bird. He immediately sets off to find his mother, but not knowing what she looks like makes it a challenge. The little hatchling is determined to find his mother, even after meeting a kitten, a hen, a dog, and a Snort. The timeless message of the bond between mother and child make P. D. Eastman's Are You My Mother? a treasured classic.  Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.", "item_summary": "Are You My Mother? is a children's book about a baby bird who hatches while his mother is away and sets out to find her, encountering various animals along the way. The story highlights the bond between mother and child with a heartwarming and humorous tone, and is designed to help young readers learn to read independently."}
{"item_id": "B0B723YW19", "item_title": "Stalked But Not Afraid (Spark of Hope)", "item_description": "RomanHe’s an influencer—whatever that means. He’s also stunningly beautiful with a feisty attitude I can’t deny intrigues me.But more importantly, he’s in trouble.I’m not like my brother. Except for being a cop, I don’t strive to save the entire world.However, I find myself compelled to save him.If he’ll calm down and just let me.BrooksHe’s everything I despise. He’s a cop. An arrogant tough-guy type who thinks he knows everything.He drives me insane and won’t take the hint that I don’t want or need his help.I’m not weak, and I’m not as defenseless as I once was either.And still, I can’t seem to fully push him away.Because maybe this time—just this once—I want to be saved.***Stalked But Not Afraid is a standalone with a HEA in the Spark of Hope Series. It’s set around a trauma-support group and will, therefore, touch on extremely sensitive subjects. I’ll always do my best to handle these topics with care and healing and with no intention of hurting anyone. But please, heed this warning if you have any triggers.", "item_summary": "Stalked But Not Afraid is a standalone LGBTQ+ romance novel set around a trauma-support group. The story follows Roman, a troubled influencer, and Brooks, a cop who is initially reluctant to accept Brooks's help, as they navigate their complex relationship amidst sensitive themes of trauma and healing."}
{"item_id": "1952430151", "item_title": "Crossed By Death (Stitches In Crime)", "item_description": "Salvaging from historic buildings isn’t supposed to require reporting a murder. When salvage expert and historian Paisley Sutton crawls into an abandoned store with a house attached, she certainly isn’t expecting to find a body on site. But soon, her discovery sends Paisley on an expedition through history that links this murder to the one that led the previous owners to abandon the building in the first place. And someone doesn’t want her to salvage this story from the wreckage. Can Paisley preserve herself and her young son while also uncovering the stories that matter most?", "item_summary": "Paisley Sutton, a salvage expert and historian, discovers a body in an abandoned historic building, leading her to investigate a linked murder from the past while trying to protect herself and her son from a present-day threat. The story blends historical mystery with contemporary suspense, exploring themes of preservation and danger."}
{"item_id": "B0BG6ZMMNN", "item_title": "Corrupted Oath (Suvorov Bratva Book 3)", "item_description": "He destroyed my world when he corrupted me in his bed. By all means, I'm supposed to hate him.But somewhere along the line, the monster who stole me ended up stealing my heart.He promised me he would do anything to protect me.Anything to protect our baby growing in my belly.To keep me close.And never let me go. Corrupt Oath is a dark mafia arranged marriage romance & psychological suspense novel by bestselling author Brook Wilder. This is the final book of the Suvorov Bratva trilogy.It is not a standalone and you'll need to read Book 1 and 2 - Dark Promise and Wicked Vows before reading.WARNING: This book contains scenes that may be disturbing to some readers.", "item_summary": "Corrupted Oath is the final installment in the Suvorov Bratva trilogy, a dark mafia arranged marriage romance that blends psychological suspense. The story follows a woman who, despite being coerced into a relationship with a dangerous man, finds herself falling for him as he vows to protect her and their unborn child."}
{"item_id": "B08X1BTKBY", "item_title": "The Duelist 3 (The Duelist (Completed Series))", "item_description": "Alex has defeated another one of his enemies in Archus Doler, but evil still lurks in the shadows of Nata Isle.Lord Asher Mec invites his two beautiful magical sisters to help investigate, but Alex and his family are still in danger.And he’ll stop at nothing to keep them safe.", "item_summary": "The Duelist 3 follows Alex as he faces lingering threats on Nata Isle after defeating a foe, with Lord Asher Mec enlisting magical aid to protect Alex and his family from ongoing dangers. The story continues the series' focus on magical intrigue and personal safety amidst persistent evil."}
{"item_id": "B07452H3NQ", "item_title": "Doctor Wolfstone’s Clinic: Unnamed Water Demon", "item_description": "Introducing a man with hypnotic methods that can lay your mind out like an open book. Doctor Wolfstone knows more about his clients than they will ever know about themselves. He can find their demons and try to get them out.", "item_summary": "Doctor Wolfstone's Clinic: Unnamed Water Demon follows Doctor Wolfstone, a hypnotist who delves into his clients' minds to uncover and confront their hidden demons. The novel explores themes of psychological exploration and the confrontation of inner darkness, blending elements of psychological suspense and the supernatural."}
{"item_id": "B09HFXWC87", "item_title": "Gentle Scars (To Be Claimed Saga)", "item_description": "From USA Today best-selling author, Willow Winters, comes a tempting tale of fated love, lust-filled secrets and the beginnings of an epic war. There was never a question of whether or not I would be his. It’s simply what fate demanded.There’s a knowing when the werewolves find their mates. It’s an aching need, a desperation… one they would die for. But for their mates, it’s a trance, a pull, a submissive desire that’s at odds with the shadows of my past and how I’ve learned to survive.I didn’t know how hard I’d fall. I didn’t know what destiny would bring.I didn’t know it then that I would die for him as he would me.This is book 2 of the To Be Claimed Saga. Wounded Kiss is book 1 and should be read first.", "item_summary": "Gentle Scars is the second book in the To Be Claimed Saga, focusing on a werewolf's fated love and the intense, often conflicting emotions experienced by his human mate. The story delves into themes of destiny, desire, and the looming threat of an epic war, set against the backdrop of a contemporary romance."}
{"item_id": "1645675602", "item_title": "Mending the Moon", "item_description": "One fateful night, the moon shines so big and so bright that it is too heavy to hold itself up in the sky. When it tumbles down and breaks into many glimmering pieces, Luna sees the whole thing. Her grandfather Poppa warns that without the moon in the sky, the oceans will stop moving and the earth will start to wobble. Luna and Poppa must mend it, but they may not be able to do it all on their own.The mountain is alive with creatures big and small whose watchful eyes also saw the moon fall. Together, can they find all the shards, stick them together, and get the moon safely back into the sky?In this enchanting tale with a timeless, folklore feel, a girl, her grandfather, and all the animals of the mountain hold the power to set the world right and forever leave their mark on the moon.", "item_summary": "Mending the Moon is a children's fantasy story about Luna and her grandfather, Poppa, who must work together with the animals of their mountain home to repair the moon after it falls from the sky and breaks into pieces. The tale, reminiscent of folklore, explores themes of community and the power of collective effort to restore balance to the world."}
{"item_id": "B09D3JCQ19", "item_title": "This Way Out", "item_description": "It’s time everyone knew the truth, and what better way to announce you’re getting married (and gay) than on your family WhatsApp group? Amar can’t wait to tell everyone his wonderful news: he’s found The One, and he’s getting married. But it turns out announcing his engagement on a group chat might not have been the best way to let his strict Muslim Bangladeshi family know that his happy-ever-after partner is a man—and a white man at that. Amar expected a reaction from his four siblings, but his bombshell sends shockwaves throughout the community and begins to fracture their family unit, already fragile from the death of their mother. Suddenly Amar is questioning everything he once believed in: his faith, his culture, his family, his mother’s love—and even his relationship with Joshua. Amar was sure he knew what love meant, but was he just plain wrong? He’s never thought of his relationship with Joshua as a love story—they just fit together, like two halves of a whole. But if they can reconcile their differences with Amar’s culture, could there be hope for his relationship with his family too? And could this whole disaster turn into a love story after all?", "item_summary": "This Way Out follows Amar, a gay Muslim man, as he navigates the fallout from announcing his engagement to a white man on his family's WhatsApp group, leading him to question his faith, culture, and relationships. The story explores Amar's journey to reconcile his identity with his family's expectations and the potential for healing and acceptance."}
{"item_id": "B09M713FJD", "item_title": "Filthy Little Tease (Itty Bitty Delights Book 3)", "item_description": "She was a temptation I could no longer deny… We were family, but not by blood. I married her mother when she was eleven years old, and I cared for her like she was my own. I never looked at Aleah with anything more than parental affections. Until she started taunting me with seductive looks and teasing me with her dirty words. That’s when I noticed what a beautiful woman she had grown into. That’s when she became my filthy little tease. Filthy Little Tease is a short novella and can be read in a couple of hours.", "item_summary": "Filthy Little Tease is an erotic novella that explores the taboo relationship between a stepfather and his stepdaughter, Aleah, who seduces him as she grows into adulthood. The story delves into themes of forbidden desire and the transformation of familial bonds into something more provocative and explicit."}
{"item_id": "B0852QWR5T", "item_title": "The Old Coal Miner's Lamp", "item_description": "After Billy loses his life in a mining accident, he becomes the carrier of the Old Coal Miner's Lamp, helping to guide other lost souls on their way to the Light. Mike begins having strange flashes of the past and seeks out the help to make sense of what he is going through. Danielle answers the call to assist Mike with his visions, but when she too begins to have some strange sensations, will she continue to search for the truth or steer clear of the unknown?Connections will be revealed and a darkness will rear its head along the way.Will Billy, Mike, and Danielle be able to work together to overcome the obstacles and defeat the darkness?", "item_summary": "The Old Coal Miner's Lamp follows Billy, who after dying in a mining accident, guides lost souls with his lamp. Mike and Danielle, who experience strange visions, join forces with Billy to uncover connections and confront a looming darkness. Together, they must overcome obstacles to defeat the encroaching threat."}
{"item_id": "B07R6B45LQ", "item_title": "The Haunting of Winchester Mansion (A Riveting Haunted House Mystery Series Book 2)", "item_description": "In the small town of Black Bay, a vacant, forgotten house sits atop an overlooking bluff. When Bailey and Bodhi Taylor move in and begin renovations, the house seems perfect. But things move on their own, screams echo from the basement, and Bailey sees a shadowy figure out of the corner of her eye. Is the house haunted? And if it is, what does the ghost want with Bailey?", "item_summary": "The Haunting of Winchester Mansion follows Bailey and Bodhi Taylor as they renovate a seemingly perfect house in Black Bay, only to encounter unexplained phenomena and a potential ghost. The story delves into whether the house is haunted and what the ghost wants with Bailey, blending mystery and suspense."}
{"item_id": "B0B4VSVGZW", "item_title": "Goodnight from Paris: A Novel", "item_description": "In Nazi-occupied France, an American film star takes on the most dangerous role of her life in a gripping novel about loyalty and resistance, inspired by a true story, from the Washington Post and Amazon Charts bestselling author of The Secret Stealers . Paris, 1939. Hollywood actress Drue Leyton, married to Frenchman Jacques Tartière, lives as an expatriate in love. But when her husband is dispatched to Brittany to work as a liaison for the British military, Drue finds herself alone with her housekeeper, adrift and heartsick in her adopted city. With her career and fame forty-five hundred miles away, Drue accepts an opportunity that will change her life forever. Befriended by seasoned wartime journalist Dorothy Thompson and urged on by political operative Jean Fraysse, Drue broadcasts radio programs to the United States. Her duty: shake America from its apathy and, as Nazis encroach and France is occupied, push for resistance and help from the US. As Drue and Jean fall under suspicion, Hitler sends his own message: when Drue’s adopted country is conquered, she will be executed. In a Paris that is no longer safe, Drue’s political passion is ignited. She’s prepared to risk anything to fight the enemy no matter how dangerous it gets—for her, for everyone she loves, and for everything she’s fighting for.", "item_summary": "Goodnight from Paris is a historical fiction novel set in Nazi-occupied France, focusing on Drue Leyton, an American film star who becomes involved in broadcasting radio programs to the United States to rally support against the Nazis. The story explores themes of loyalty, resistance, and the personal risks taken to fight against oppression, inspired by true events."}
{"item_id": "1984860399", "item_title": "On Tyranny Graphic Edition: Twenty Lessons from the Twentieth Century", "item_description": "NEW YORK TIMES BESTSELLER • A graphic edition of historian Timothy Snyder’s lessons for surviving and resisting America’s arc toward authoritarianism, featuring the visual storytelling talents of renowned illustrator Nora Krug “Nora Krug has visualized and rendered some of the most valuable lessons of the twentieth century, which will serve all citizens as we shape the future.”—Shepard Fairey, artist and activist Timothy Snyder’s New York Times bestseller On Tyranny uses the darkest moments in twentieth-century history, from Nazism to Communism, to teach twenty lessons on resisting modern-day authoritarianism. Among the twenty include a warning to be aware of how symbols used today could affect tomorrow (“4: Take responsibility for the face of the world”), an urgent reminder to research everything for yourself and to the fullest extent (“11: Investigate”), a point to use personalized and individualized speech rather than clichéd phrases for the sake of mass appeal (“9: Be kind to our language”), and more.In this graphic edition, Nora Krug draws from her highly inventive art style in Belonging —at once a graphic memoir, collage-style scrapbook, historical narrative, and trove of memories—to breathe new life, color, and power into Snyder’s riveting historical references, turning a quick-read pocket guide of lessons into a visually striking rumination. In a time of great uncertainty and instability, this edition of On Tyranny emphasizes the importance of being active, conscious, and deliberate participants in resistance.", "item_summary": "On Tyranny Graphic Edition presents twenty historical lessons from the twentieth century, focusing on the rise of authoritarian regimes like Nazism and Communism, to guide readers in resisting contemporary authoritarianism. Through a blend of historical analysis and visual storytelling, the book emphasizes the importance of personal responsibility, critical thinking, and active engagement in preserving democratic values."}
{"item_id": "B098PGQCXH", "item_title": "Out Of Time (Book 6) (Detective Ava Locke Series)", "item_description": "The killer’s identity has been revealed. It’s a win for Ava but as the killer realises that he is on borrowed time, he decides to go all out and take matters into his own hands. As the tech specialist figures out the inner workings of the killer’s app, the team is forced to play a game of cat and mouse, full of leads and different turns. Ava and the team are a few steps closer to finding the killer’s identity. However, with information this big, comes consequences. Ava must now figure out how to prevent another murder from happening while also holding on to her last thread of sanity. Will she ever win the battle against time and track the killer?", "item_summary": "Out Of Time is the sixth book in the Detective Ava Locke Series, a thriller where Detective Ava Locke and her team race against time to stop a killer who has revealed his identity and is now on a rampage. As they unravel the killer's app and follow leads, Ava must prevent another murder while managing the psychological toll of the case."}
{"item_id": "0062878166", "item_title": "Bea Is for Blended", "item_description": "Girl p ower scores a goal in this uplifting story of teamwork, new beginnings, and coming together to fight for what’s right—perfect for fans of Lisa Graff and Lynda Mullaly Hunt. Bea and her mom have always been a two-person team. But now her mom is marrying Wendell, and their team is growing by three boys, two dogs, and a cat. Finding her place in her new blended family may be tough, but when Bea finds out her school might not get the all-girls soccer team they’d been promised, she learns that the bigger the team, the stronger the fight—and that for the girls to get what they deserve, they’re going to need a squad behind them. Lauded as “remarkable” by the New York Times Book Review , Lindsey Stoddard’s heartfelt stories continue to garner critical acclaim, and her latest novel will have fans new and old rooting for Bea as she discovers that building a new life doesn’t mean leaving her old one behind.", "item_summary": "Bea Is for Blended follows Bea as she navigates her new blended family and fights for an all-girls soccer team at her school. The story explores themes of teamwork, adaptation, and standing up for what is right, as Bea learns to integrate her old life with her new beginnings."}
{"item_id": "B09CN6FZKV", "item_title": "Origami For Kids: 50 Amazing Paper Folding Projects With Simple Step By Step Instructions (Origami Fun)", "item_description": "Origami for Kids Are you looking for a calming and entertaining activity for your child? Do you want your child to develop a hobby that is educational and entertaining? If so, then Origami for Kids is the perfect book for you!Learning the art of origami, or paper folding has many benefits for young minds. This ancient art form encourages creativity, develops patience, and promotes a sense of achievement. With minimal supplies needed—only one or two pieces of paper—it’s a great hobby to practice anywhere! With simple-to-follow instructions, your child can begin with a boat or rabbit and advance to the more complex seahorse, lotus flower, or elephant design. When you see the amazing creations from a simple piece of paper, you may want to join the fun yourself! Features Include: 50 origami designs 50 origami designs No previous experience necessary No previous experience necessary A great alternative to tablets and phones A great alternative to tablets and phones Minimum supplies required Minimum supplies required Great for learners of all ages Great for learners of all ages If your child is ready to learn this beautiful art form, select 'Buy Now' and purchase Origami for Kids!", "item_summary": "Origami for Kids is an instructional book that teaches children the art of paper folding, offering 50 designs ranging from simple boats and rabbits to more complex figures like seahorses and elephants. The book emphasizes the educational and creative benefits of origami, requiring minimal supplies and suitable for learners of all ages."}
{"item_id": "1949066819", "item_title": "A Ghostly Twist", "item_description": "Facts are the closest things Sam has to a friend but they're no use when ghosts start talking to him. He's determined to find answers to problems, but when he sees crazy twisting vines and ghostly faces at an abandoned house he's thrown out of his element. Then there's the folktale about the Dragonfly, which sank nearly 200 years ago and has yet to be found. Could the ghosts he's heard be the key to finding the ship-and her treasure? Sam needs help, but are the kids from the campground really his friends? Will they help him when an unnatural storm takes them further than they ever imagined? Or will Sam be on his own to solve the mysteries before they run out of time?", "item_summary": "Sam, a fact-loving boy, encounters ghosts and strange phenomena at an abandoned house, leading him to investigate a local folktale about a sunken ship and its treasure. As Sam delves deeper, he must determine if new acquaintances from a campground are true friends who will assist him in unraveling the mysteries before time runs out."}
{"item_id": "1335404708", "item_title": "His Secret Starlight Baby (Welcome to Starlight, 4)", "item_description": "Becoming a father wasn’t part of his game plan in USA TODAY bestselling author Michelle Major’s latest book in her Welcome to Starlight miniseries!Coparenting this baby Is going to take teamwork Former professional football player Jordan Schaeffer’s game plan was simple: retire from football and set up a quiet life in Starlight. But when Cory Hall arrives with their infant son, Jordan not only gets a surprise but has to devise a new life strategy. And Cory finds herself agreeing to be his fake fiancée until they work out a coparenting plan. Jordan may have rewritten the dating playbook…but will it be enough to bring this team together? From Harlequin Special Edition: Believe in love. Overcome obstacles. Find happiness.Welcome to Starlight Book 1: The Best Intentions Book 2: The Last Man She Expected Book 3: His Last-Chance Christmas Family Book 4: His Secret Starlight Baby", "item_summary": "His Secret Starlight Baby follows former professional football player Jordan Schaeffer, whose quiet retirement plans are disrupted when Cory Hall arrives with their infant son. The two must navigate coparenting and a fake engagement to find a stable family dynamic. This romantic novel explores themes of love, overcoming obstacles, and finding happiness within a small-town setting."}
{"item_id": "0593139135", "item_title": "Greenlights", "item_description": "#1 NEW YORK TIMES BESTSELLER • Discover the life-changing memoir that has inspired millions of readers through the Academy Award®–winning actor’s unflinching honesty, unconventional wisdom, and lessons learned the hard way about living with greater satisfaction. “The No. 1 celebrity memoir of the past 10 years.”— USA Today “McConaughey’s book invites us to grapple with the lessons of his life as he did—and to see that the point was never to win, but to understand.”—Mark Manson, author of The Subtle Art of Not Giving a F*ck I’ve been in this life for fifty years, been trying to work out its riddle for forty-two, and been keeping diaries of clues to that riddle for the last thirty-five. Notes about successes and failures, joys and sorrows, things that made me marvel, and things that made me laugh out loud. How to be fair. How to have less stress. How to have fun. How to hurt people less. How to get hurt less. How to be a good man. How to have meaning in life. How to be more me. Recently, I worked up the courage to sit down with those diaries. I found stories I experienced, lessons I learned and forgot, poems, prayers, prescriptions, beliefs about what matters, some great photographs, and a whole bunch of bumper stickers. I found a reliable theme, an approach to living that gave me more satisfaction, at the time, and still: If you know how, and when, to deal with life’s challenges—how to get relative with the inevitable —you can enjoy a state of success I call “catching greenlights.” So I took a one-way ticket to the desert and wrote this book: an album, a record, a story of my life so far. This is fifty years of my sights and seens, felts and figured-outs, cools and shamefuls. Graces, truths, and beauties of brutality. Getting away withs, getting caughts, and getting wets while trying to dance between the raindrops. Hopefully, it’s medicine that tastes good, a couple of aspirin instead of the infirmary, a spaceship to Mars without needing your pilot’s license, going to church without having to be born again, and laughing through the tears. It’s a love letter. To life. It’s also a guide to catching more greenlights—and to realizing that the yellows and reds eventually turn green too. Good luck. The short dust jacket included with this hardcover edition is an intentional design choice.", "item_summary": "\"Greenlights\" is a memoir by Matthew McConaughey that chronicles his life experiences and lessons learned over fifty years, drawing from his personal diaries. The book explores his journey towards personal growth and satisfaction, offering insights on navigating life's challenges and finding meaning, all while maintaining a candid and reflective tone."}
{"item_id": "B086XH83JN", "item_title": "False Skies (Challenger's Call Book 5)", "item_description": "The darkness fell.He broke through it anyway.Now another boundary appears, another supposed king, with another false ceiling, demanding that Wes accept his victories and go back home.That he go no farther.But his people, his throne, and the woman he loves are still on the other side.So now Wes Malcolm chooses to wage war on the ancient powers reigning in the supposed heavens.Because they are not his heavens, not his gods.And these are not his skies.", "item_summary": "False Skies is the fifth book in the Challenger's Call series, following Wes Malcolm as he defies ancient powers and false gods to reclaim his people, throne, and the woman he loves. The narrative focuses on Wes's refusal to accept imposed boundaries, driving him to wage war against the forces controlling the heavens."}
{"item_id": "B07N6KBQ11", "item_title": "Miss March (Pin-Up Mysteries #3)", "item_description": "A SHORT STORYMiss March, also known as Lana Tisdale, was an old flame of private investigator Jake Palmer. Someone has taken her daughter and she asks Palmer for help. Soon, Palmer becomes the target of someone who will do anything to get what they want...including murder.A USA TODAY BESTSELLING AUTHOR\"Ames is a sensation among readers who love fast-paced thrillers.\" -MysteryTribune", "item_summary": "Private investigator Jake Palmer is drawn into a dangerous game when his old flame, Lana Tisdale, seeks his help to find her kidnapped daughter, making Palmer a target for a ruthless adversary. This fast-paced thriller blends elements of mystery and suspense, focusing on themes of danger and pursuit."}
